[Timeout] BlockStatement
services/passwordServices.js:4:44
 const argon2 = require('argon2');
 const User = require('../models/User');
 
-exports.hashPassword = async (password) => {
-    try {
-        const hash = await argon2.hash(password, {
-            type: argon2.argon2id, // Specifies to use Argon2id
-            memoryCost: 2 ** 16, // Sets memory usage, currently at 64 MB
-            timeCost: 3, // the number of iterations it will do, first iteration uses argon2i
-            parallelism: 1, //Limit on number of CPU cores it will use
-        });
-        return hash;
-
-    }catch (err){
-        err.message = 'Error hashing password';
-        throw new Error(err);        
-    }
-}
+exports.hashPassword = async (password) => {}
 
 exports.getPasswordById = async (id) => {

[Timeout] BlockStatement
services/passwordServices.js:5:9
 const User = require('../models/User');
 
 exports.hashPassword = async (password) => {
-    try {
-        const hash = await argon2.hash(password, {
-            type: argon2.argon2id, // Specifies to use Argon2id
-            memoryCost: 2 ** 16, // Sets memory usage, currently at 64 MB
-            timeCost: 3, // the number of iterations it will do, first iteration uses argon2i
-            parallelism: 1, //Limit on number of CPU cores it will use
-        });
-        return hash;
-
-    }catch (err){
+    try {}catch (err){
         err.message = 'Error hashing password';
         throw new Error(err);        

[Killed] BlockStatement
services/passwordServices.js:14:17
         });
         return hash;
 
-    }catch (err){
-        err.message = 'Error hashing password';
-        throw new Error(err);        
-    }
+    }catch (err){}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.9392ms)
✔ CourseController - createCourse with incomplete data (1.2573ms)

[Killed] StringLiteral
services/passwordServices.js:15:23
         return hash;
 
     }catch (err){
-        err.message = 'Error hashing password';
+        err.message = "";
         throw new Error(err);        
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.7005ms)

[Killed] BlockStatement
services/passwordServices.js:20:41
     }
 }
 
-exports.getPasswordById = async (id) => {
-    const user = await User.findById(id).select('password_hash').lean();
-    return user.password_hash;
-}
+exports.getPasswordById = async (id) => {}
 
 // verify a given password and hash
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.858ms)

[Timeout] BlockStatement
services/passwordServices.js:26:62
 }
 
 // verify a given password and hash
-exports.verifyPassword = async (password, hashedPassword) => {
-    return await argon2.verify(hashedPassword, password);
-};
+exports.verifyPassword = async (password, hashedPassword) => {};
