[Timeout] BlockStatement
controllers/courseController.js:3:45
 const courseService = require('../services/courseServices');
 
-exports.getAllCourses = async (req, res) => {
-    try {
-        const courses = await courseService.getAllCourses();
-        res.status(200).json(courses);
-    } catch (error) {
-        res.status(500).json({ error: 'Database Error' });
-    }
-}
+exports.getAllCourses = async (req, res) => {}
 
 exports.findCourseById = async (req, res) => {

[Timeout] BlockStatement
controllers/courseController.js:4:9
 const courseService = require('../services/courseServices');
 
 exports.getAllCourses = async (req, res) => {
-    try {
-        const courses = await courseService.getAllCourses();
-        res.status(200).json(courses);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: 'Database Error' });
     }

[Killed] BlockStatement
controllers/courseController.js:7:21
     try {
         const courses = await courseService.getAllCourses();
         res.status(200).json(courses);
-    } catch (error) {
-        res.status(500).json({ error: 'Database Error' });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 0,
  body: null,
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0687ms)

[Killed] ObjectLiteral
controllers/courseController.js:8:30
         const courses = await courseService.getAllCourses();
         res.status(200).json(courses);
     } catch (error) {
-        res.status(500).json({ error: 'Database Error' });
+        res.status(500).json({});
     }
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: {},
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.8902ms)

[Killed] BlockStatement
controllers/courseController.js:12:46
     }
 }
 
-exports.findCourseById = async (req, res) => {
-    const { id } = req.params;
-    try {
-        const course = await courseService.findCourseById(id);
-        if (!course) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.status(200).json(course);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.findCourseById = async (req, res) => {}
 
 exports.createCourse = async (req, res) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3439ms)

[Killed] BlockStatement
controllers/courseController.js:14:9
 
 exports.findCourseById = async (req, res) => {
     const { id } = req.params;
-    try {
-        const course = await courseService.findCourseById(id);
-        if (!course) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.status(200).json(course);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.2403ms)

[Killed] ConditionalExpression
controllers/courseController.js:16:13
     const { id } = req.params;
     try {
         const course = await courseService.findCourseById(id);
-        if (!course) {
+        if (true) {
             return res.status(404).json({ error: 'Course not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3245ms)

[Killed] BlockStatement
controllers/courseController.js:16:22
     const { id } = req.params;
     try {
         const course = await courseService.findCourseById(id);
-        if (!course) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
+        if (!course) {}
         res.status(200).json(course);
     } catch (error) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.277ms)

[Killed] StringLiteral
controllers/courseController.js:17:50
     try {
         const course = await courseService.findCourseById(id);
         if (!course) {
-            return res.status(404).json({ error: 'Course not found' });
+            return res.status(404).json({ error: "" });
         }
         res.status(200).json(course);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3573ms)

[Killed] ObjectLiteral
controllers/courseController.js:17:41
     try {
         const course = await courseService.findCourseById(id);
         if (!course) {
-            return res.status(404).json({ error: 'Course not found' });
+            return res.status(404).json({});
         }
         res.status(200).json(course);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8672ms)

[Killed] BlockStatement
controllers/courseController.js:20:21
             return res.status(404).json({ error: 'Course not found' });
         }
         res.status(200).json(course);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.0743ms)

[Timeout] BlockStatement
controllers/courseController.js:25:44
     }
 }
 
-exports.createCourse = async (req, res) => {
-    try {
-        
-        const courseData = req.body;
-        const newCourse = await courseService.createCourse(courseData);
-        res.status(201).json(newCourse);
-    }   catch (error) { 
-        if(error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        }
-        else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
-}   
+exports.createCourse = async (req, res) => {}   
 
 exports.updateCourse = async (req, res) => {

[Timeout] BlockStatement
controllers/courseController.js:26:9
 }
 
 exports.createCourse = async (req, res) => {
-    try {
-        
-        const courseData = req.body;
-        const newCourse = await courseService.createCourse(courseData);
-        res.status(201).json(newCourse);
-    }   catch (error) { 
+    try {}   catch (error) { 
         if(error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });

[Killed] BlockStatement
controllers/courseController.js:31:23
         const courseData = req.body;
         const newCourse = await courseService.createCourse(courseData);
         res.status(201).json(newCourse);
-    }   catch (error) { 
-        if(error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        }
-        else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
+    }   catch (error) {}
 }   
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.4849ms)
✖ CourseController - createCourse with incomplete data (1.7774ms)

[Killed] ConditionalExpression
controllers/courseController.js:32:12
         const newCourse = await courseService.createCourse(courseData);
         res.status(201).json(newCourse);
     }   catch (error) { 
-        if(error.message.includes('already exists')) {
+        if(false) {
             res.status(409).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.677ms)

[Killed] ConditionalExpression
controllers/courseController.js:32:12
         const newCourse = await courseService.createCourse(courseData);
         res.status(201).json(newCourse);
     }   catch (error) { 
-        if(error.message.includes('already exists')) {
+        if(true) {
             res.status(409).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5308ms)

[Killed] ConditionalExpression
controllers/courseController.js:35:17
         if(error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
         }
-        else if(error.message.includes('incomplete')) {
+        else if(true) {
             res.status(422).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.0605ms)

[Killed] ConditionalExpression
controllers/courseController.js:35:17
         if(error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
         }
-        else if(error.message.includes('incomplete')) {
+        else if(false) {
             res.status(422).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (8.0009ms)

[Killed] ObjectLiteral
controllers/courseController.js:36:34
             res.status(409).json({ error: error.message });
         }
         else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
+            res.status(422).json({});
         }
         else res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.1745ms)

[Timeout] BlockStatement
controllers/courseController.js:42:44
     }
 }   
 
-exports.updateCourse = async (req, res) => {
-   
-    
-    const { id } = req.params;
-    const courseData = req.body;    
-    try {
-        const updatedCourse = await courseService.updateCourse(id, courseData);
-        if (!updatedCourse) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.json(updatedCourse);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.updateCourse = async (req, res) => {}
 //tries to delete a course, returns an error if the course is not found.
 exports.deleteCourse = async (req, res) => {

[Timeout] BlockStatement
controllers/courseController.js:47:9
     
     const { id } = req.params;
     const courseData = req.body;    
-    try {
-        const updatedCourse = await courseService.updateCourse(id, courseData);
-        if (!updatedCourse) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.json(updatedCourse);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }

[Killed] ConditionalExpression
controllers/courseController.js:49:13
     const courseData = req.body;    
     try {
         const updatedCourse = await courseService.updateCourse(id, courseData);
-        if (!updatedCourse) {
+        if (true) {
             return res.status(404).json({ error: 'Course not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4939ms)

[Killed] BooleanLiteral
controllers/courseController.js:49:13
     const courseData = req.body;    
     try {
         const updatedCourse = await courseService.updateCourse(id, courseData);
-        if (!updatedCourse) {
+        if (updatedCourse) {
             return res.status(404).json({ error: 'Course not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.6134ms)

[Timeout] BlockStatement
controllers/courseController.js:53:21
             return res.status(404).json({ error: 'Course not found' });
         }
         res.json(updatedCourse);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 //tries to delete a course, returns an error if the course is not found.

[Timeout] BlockStatement
controllers/courseController.js:58:44
     }
 }
 //tries to delete a course, returns an error if the course is not found.
-exports.deleteCourse = async (req, res) => {
-    const { id } = req.params;
-    try {
-        const deletedCourse = await courseService.deleteCourse(id);
-        if (!deletedCourse) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.json({ message: 'Course deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.deleteCourse = async (req, res) => {}
 
 exports.getSampleCourses = async (req, res) => {

[Timeout] BlockStatement
controllers/courseController.js:60:9
 //tries to delete a course, returns an error if the course is not found.
 exports.deleteCourse = async (req, res) => {
     const { id } = req.params;
-    try {
-        const deletedCourse = await courseService.deleteCourse(id);
-        if (!deletedCourse) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
-        res.json({ message: 'Course deleted successfully' });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }

[Killed] ConditionalExpression
controllers/courseController.js:62:13
     const { id } = req.params;
     try {
         const deletedCourse = await courseService.deleteCourse(id);
-        if (!deletedCourse) {
+        if (false) {
             return res.status(404).json({ error: 'Course not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3921ms)

[Killed] BlockStatement
controllers/courseController.js:62:29
     const { id } = req.params;
     try {
         const deletedCourse = await courseService.deleteCourse(id);
-        if (!deletedCourse) {
-            return res.status(404).json({ error: 'Course not found' });
-        }
+        if (!deletedCourse) {}
         res.json({ message: 'Course deleted successfully' });
     } catch (error) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (9.3152ms)

[Timeout] BlockStatement
controllers/courseController.js:66:21
             return res.status(404).json({ error: 'Course not found' });
         }
         res.json({ message: 'Course deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 

[Killed] BlockStatement
controllers/courseController.js:71:48
     }
 }
 
-exports.getSampleCourses = async (req, res) => {
-    try {
-        const sampleCourses = await courseService.getSampleCourses();
-        res.json(sampleCourses);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.getSampleCourses = async (req, res) => {}
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.8882ms)

[Killed] BlockStatement
controllers/courseController.js:72:9
 }
 
 exports.getSampleCourses = async (req, res) => {
-    try {
-        const sampleCourses = await courseService.getSampleCourses();
-        res.json(sampleCourses);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (8.0437ms)

[Killed] BlockStatement
controllers/courseController.js:75:21
     try {
         const sampleCourses = await courseService.getSampleCourses();
         res.json(sampleCourses);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.324ms)
