[Killed] BlockStatement
controllers/definitionController.js:4:58
 const definitionService = require('../services/definitionServices');
 const userService = require('../services/userServices');
 
-exports.getDefinitionsByCourseCode = async (req, res) => {
-    const { courseCode } = req.params;
-    try {
-        const definitions = await definitionService.getDefinitionsByCourseCode(courseCode);
-        res.status(200).json(definitions);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.getDefinitionsByCourseCode = async (req, res) => {}
 
 exports.createDefinition = async (req, res) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (7.6949ms)

[Killed] BlockStatement
controllers/definitionController.js:6:9
 
 exports.getDefinitionsByCourseCode = async (req, res) => {
     const { courseCode } = req.params;
-    try {
-        const definitions = await definitionService.getDefinitionsByCourseCode(courseCode);
-        res.status(200).json(definitions);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2518ms)

[Killed] BlockStatement
controllers/definitionController.js:9:21
     try {
         const definitions = await definitionService.getDefinitionsByCourseCode(courseCode);
         res.status(200).json(definitions);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.1644ms)

[Killed] ObjectLiteral
controllers/definitionController.js:10:30
         const definitions = await definitionService.getDefinitionsByCourseCode(courseCode);
         res.status(200).json(definitions);
     } catch (error) {
-        res.status(500).json({ error: error.message });
+        res.status(500).json({});
     }
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9778ms)

[Timeout] BlockStatement
controllers/definitionController.js:14:48
     }
 }
 
-exports.createDefinition = async (req, res) => {
-    try {
-        const definitionData = req.body;
-        const sessionData = req.session.user;
-        const newDefinition = await definitionService.createDefinition(definitionData, sessionData);
-        await userService.addContribution(sessionData.id, {
-            refId: newDefinition._id,
-            contributionType: 'definition',
-            courseCode: newDefinition.courseCode
-        });
-        res.status(201).json(newDefinition);
-    }
-    catch (error) {
-        if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
-}
+exports.createDefinition = async (req, res) => {}
 
 exports.deleteDefinition = async (req, res) => {

[Timeout] BlockStatement
controllers/definitionController.js:15:9
 }
 
 exports.createDefinition = async (req, res) => {
-    try {
-        const definitionData = req.body;
-        const sessionData = req.session.user;
-        const newDefinition = await definitionService.createDefinition(definitionData, sessionData);
-        await userService.addContribution(sessionData.id, {
-            refId: newDefinition._id,
-            contributionType: 'definition',
-            courseCode: newDefinition.courseCode
-        });
-        res.status(201).json(newDefinition);
-    }
+    try {}
     catch (error) {
         if(error.message.includes('incomplete')) {

[Killed] BlockStatement
controllers/definitionController.js:26:19
         });
         res.status(201).json(newDefinition);
     }
-    catch (error) {
-        if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
+    catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1532ms)

[Killed] ConditionalExpression
controllers/definitionController.js:27:12
         res.status(201).json(newDefinition);
     }
     catch (error) {
-        if(error.message.includes('incomplete')) {
+        if(true) {
             res.status(422).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.0163ms)

[Killed] ConditionalExpression
controllers/definitionController.js:27:12
         res.status(201).json(newDefinition);
     }
     catch (error) {
-        if(error.message.includes('incomplete')) {
+        if(false) {
             res.status(422).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.641ms)

[Timeout] BlockStatement
controllers/definitionController.js:34:48
     }
 }
 
-exports.deleteDefinition = async (req, res) => {
-    const { id } = req.params;
-    try {
-        await definitionService.deleteDefinition(id);
-        res.status(204).send();
-    }
-    catch (error) {
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }   
-}
+exports.deleteDefinition = async (req, res) => {}
 exports.updateDefinition = async (req, res) => {
     const { id } = req.params;

[Timeout] BlockStatement
controllers/definitionController.js:36:9
 
 exports.deleteDefinition = async (req, res) => {
     const { id } = req.params;
-    try {
-        await definitionService.deleteDefinition(id);
-        res.status(204).send();
-    }
+    try {}
     catch (error) {
         if(error.message.includes('not found')) {

[Killed] BlockStatement
controllers/definitionController.js:40:19
         await definitionService.deleteDefinition(id);
         res.status(204).send();
     }
-    catch (error) {
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }   
+    catch (error) {}   
 }
 exports.updateDefinition = async (req, res) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.9242ms)

[Killed] ConditionalExpression
controllers/definitionController.js:41:12
         res.status(204).send();
     }
     catch (error) {
-        if(error.message.includes('not found')) {
+        if(true) {
             res.status(404).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1495ms)

[Killed] BlockStatement
controllers/definitionController.js:41:49
         res.status(204).send();
     }
     catch (error) {
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
+        if(error.message.includes('not found')) {}
         else res.status(500).json({ error: error.message });
     }   
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2912ms)

[Killed] ObjectLiteral
controllers/definitionController.js:42:34
     }
     catch (error) {
         if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
+            res.status(404).json({});
         }
         else res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0882ms)

[Timeout] BlockStatement
controllers/definitionController.js:47:48
         else res.status(500).json({ error: error.message });
     }   
 }
-exports.updateDefinition = async (req, res) => {
-    const { id } = req.params;
-    const updateData = req.body;
-    const sessionData = req.session.user;
-    try {
-        const updatedDefinition = await definitionService.updateDefinition(id, updateData, sessionData);
-        if (!updatedDefinition) {
-            return res.status(404).json({ error: 'Definition not found' });
-        }
-        await userService.addContribution(sessionData.id, {
-            refId: updatedDefinition._id,
-            contributionType: 'definition',
-            courseCode: updatedDefinition.courseCode
-        });
-        res.status(200).json(updatedDefinition);
-    } catch (error) {   
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
-        else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
-}
+exports.updateDefinition = async (req, res) => {}
 

[Timeout] BlockStatement
controllers/definitionController.js:51:9
     const { id } = req.params;
     const updateData = req.body;
     const sessionData = req.session.user;
-    try {
-        const updatedDefinition = await definitionService.updateDefinition(id, updateData, sessionData);
-        if (!updatedDefinition) {
-            return res.status(404).json({ error: 'Definition not found' });
-        }
-        await userService.addContribution(sessionData.id, {
-            refId: updatedDefinition._id,
-            contributionType: 'definition',
-            courseCode: updatedDefinition.courseCode
-        });
-        res.status(200).json(updatedDefinition);
-    } catch (error) {   
+    try {} catch (error) {   
         if(error.message.includes('not found')) {
             res.status(404).json({ error: error.message });

[Killed] BooleanLiteral
controllers/definitionController.js:53:13
     const sessionData = req.session.user;
     try {
         const updatedDefinition = await definitionService.updateDefinition(id, updateData, sessionData);
-        if (!updatedDefinition) {
+        if (updatedDefinition) {
             return res.status(404).json({ error: 'Definition not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.9756ms)
✔ CourseController - createCourse with incomplete data (0.9258ms)

[Killed] BlockStatement
controllers/definitionController.js:53:33
     const sessionData = req.session.user;
     try {
         const updatedDefinition = await definitionService.updateDefinition(id, updateData, sessionData);
-        if (!updatedDefinition) {
-            return res.status(404).json({ error: 'Definition not found' });
-        }
+        if (!updatedDefinition) {}
         await userService.addContribution(sessionData.id, {
             refId: updatedDefinition._id,
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2952ms)

[Killed] BlockStatement
controllers/definitionController.js:62:21
             courseCode: updatedDefinition.courseCode
         });
         res.status(200).json(updatedDefinition);
-    } catch (error) {   
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
-        else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2191ms)

[Killed] BlockStatement
controllers/definitionController.js:63:49
         });
         res.status(200).json(updatedDefinition);
     } catch (error) {   
-        if(error.message.includes('not found')) {
-            res.status(404).json({ error: error.message });
-        }
+        if(error.message.includes('not found')) {}
         else if(error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2876ms)

[Killed] ConditionalExpression
controllers/definitionController.js:63:12
         });
         res.status(200).json(updatedDefinition);
     } catch (error) {   
-        if(error.message.includes('not found')) {
+        if(true) {
             res.status(404).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3298ms)

[Killed] BlockStatement
controllers/definitionController.js:66:55
         if(error.message.includes('not found')) {
             res.status(404).json({ error: error.message });
         }
-        else if(error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
+        else if(error.message.includes('incomplete')) {}
         else res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0785ms)
