[Timeout] BlockStatement
controllers/sectionController.js:4:45
 const sectionService = require('../services/sectionServices');
 const userService = require('../services/userServices');
 
-exports.createSection = async (req, res) => {
-    try {
-        const sectionData = req.body;
-        const sessionData = req.session.user;
-        const newSection = await sectionService.createSection(sectionData, sessionData);
-        await userService.addContribution(sessionData.id, {
-            refId: newSection._id,
-            contributionType: 'section',
-            courseCode: newSection.courseCode
-        });
-        res.status(201).json(newSection);
-    } catch (error) {
-        if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        } else if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        } else {
-            res.status(500).json({ error: error.message });
-        }
-    }
-}
+exports.createSection = async (req, res) => {}
 
 exports.getSectionsByCourseCode = async (req, res) => {

[Timeout] BlockStatement
controllers/sectionController.js:5:9
 const userService = require('../services/userServices');
 
 exports.createSection = async (req, res) => {
-    try {
-        const sectionData = req.body;
-        const sessionData = req.session.user;
-        const newSection = await sectionService.createSection(sectionData, sessionData);
-        await userService.addContribution(sessionData.id, {
-            refId: newSection._id,
-            contributionType: 'section',
-            courseCode: newSection.courseCode
-        });
-        res.status(201).json(newSection);
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });

[Killed] ObjectLiteral
controllers/sectionController.js:9:59
         const sectionData = req.body;
         const sessionData = req.session.user;
         const newSection = await sectionService.createSection(sectionData, sessionData);
-        await userService.addContribution(sessionData.id, {
-            refId: newSection._id,
-            contributionType: 'section',
-            courseCode: newSection.courseCode
-        });
+        await userService.addContribution(sessionData.id, {});
         res.status(201).json(newSection);
     } catch (error) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (7.7238ms)

[Killed] BlockStatement
controllers/sectionController.js:15:21
             courseCode: newSection.courseCode
         });
         res.status(201).json(newSection);
-    } catch (error) {
-        if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        } else if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        } else {
-            res.status(500).json({ error: error.message });
-        }
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3738ms)

[Killed] BlockStatement
controllers/sectionController.js:16:55
         });
         res.status(201).json(newSection);
     } catch (error) {
-        if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        } else if (error.message.includes('incomplete')) {
+        if (error.message.includes('already exists')) {} else if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
         } else {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.4211ms)

[Killed] ObjectLiteral
controllers/sectionController.js:17:34
         res.status(201).json(newSection);
     } catch (error) {
         if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
+            res.status(409).json({});
         } else if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.8499ms)

[Killed] ConditionalExpression
controllers/sectionController.js:18:20
     } catch (error) {
         if (error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
-        } else if (error.message.includes('incomplete')) {
+        } else if (true) {
             res.status(422).json({ error: error.message });
         } else {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.052ms)

[Killed] ConditionalExpression
controllers/sectionController.js:18:20
     } catch (error) {
         if (error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
-        } else if (error.message.includes('incomplete')) {
+        } else if (false) {
             res.status(422).json({ error: error.message });
         } else {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8354ms)

[Killed] BlockStatement
controllers/sectionController.js:20:16
             res.status(409).json({ error: error.message });
         } else if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
-        } else {
-            res.status(500).json({ error: error.message });
-        }
+        } else {}
     }
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1925ms)

[Killed] BlockStatement
controllers/sectionController.js:26:55
     }
 }
 
-exports.getSectionsByCourseCode = async (req, res) => {
-    const { courseCode } = req.params;
-    try {
-        const sections = await sectionService.getSectionsByCourseCode(courseCode);
-        res.status(200).json(sections);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.getSectionsByCourseCode = async (req, res) => {}
 
 exports.deleteSection = async (req, res) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.8892ms)

[Killed] BlockStatement
controllers/sectionController.js:28:9
 
 exports.getSectionsByCourseCode = async (req, res) => {
     const { courseCode } = req.params;
-    try {
-        const sections = await sectionService.getSectionsByCourseCode(courseCode);
-        res.status(200).json(sections);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1026ms)

[Killed] BlockStatement
controllers/sectionController.js:31:21
     try {
         const sections = await sectionService.getSectionsByCourseCode(courseCode);
         res.status(200).json(sections);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1239ms)

[Timeout] BlockStatement
controllers/sectionController.js:36:45
     }
 }
 
-exports.deleteSection = async (req, res) => {
-    const { id } = req.params;  
-    try {
-        const deletedSection = await sectionService.deleteSection(id);
-        if (!deletedSection) {
-            return res.status(404).json({ error: 'Section not found' });
-        }
-        res.status(200).json({ message: 'Section deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.deleteSection = async (req, res) => {}
 
 exports.updateSection = async (req, res) => {  

[Timeout] BlockStatement
controllers/sectionController.js:38:9
 
 exports.deleteSection = async (req, res) => {
     const { id } = req.params;  
-    try {
-        const deletedSection = await sectionService.deleteSection(id);
-        if (!deletedSection) {
-            return res.status(404).json({ error: 'Section not found' });
-        }
-        res.status(200).json({ message: 'Section deleted successfully' });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }

[Killed] ConditionalExpression
controllers/sectionController.js:40:13
     const { id } = req.params;  
     try {
         const deletedSection = await sectionService.deleteSection(id);
-        if (!deletedSection) {
+        if (false) {
             return res.status(404).json({ error: 'Section not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3689ms)

[Killed] BooleanLiteral
controllers/sectionController.js:40:13
     const { id } = req.params;  
     try {
         const deletedSection = await sectionService.deleteSection(id);
-        if (!deletedSection) {
+        if (deletedSection) {
             return res.status(404).json({ error: 'Section not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.6907ms)

[Killed] StringLiteral
controllers/sectionController.js:43:41
         if (!deletedSection) {
             return res.status(404).json({ error: 'Section not found' });
         }
-        res.status(200).json({ message: 'Section deleted successfully' });
+        res.status(200).json({ message: "" });
     } catch (error) {
         res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.586ms)

[Killed] BlockStatement
controllers/sectionController.js:44:21
             return res.status(404).json({ error: 'Section not found' });
         }
         res.status(200).json({ message: 'Section deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4814ms)

[Timeout] BlockStatement
controllers/sectionController.js:49:45
     }
 }
 
-exports.updateSection = async (req, res) => {  
-    const { id } = req.params;
-    const updateData = req.body;
-    const sessionData = req.session.user;
-    try {
-        const updatedSection = await sectionService.updateSection(id, updateData, sessionData);
-        if (!updatedSection) {
-            return res.status(404).json({ error: 'Section not found' });
-        }
-        await userService.addContribution(sessionData.id, {
-            refId: updatedSection._id,
-            contributionType: 'section',
-            courseCode: updatedSection.courseCode
-        });
-        res.status(200).json(updatedSection);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.updateSection = async (req, res) => {}

[Timeout] BlockStatement
controllers/sectionController.js:53:9
     const { id } = req.params;
     const updateData = req.body;
     const sessionData = req.session.user;
-    try {
-        const updatedSection = await sectionService.updateSection(id, updateData, sessionData);
-        if (!updatedSection) {
-            return res.status(404).json({ error: 'Section not found' });
-        }
-        await userService.addContribution(sessionData.id, {
-            refId: updatedSection._id,
-            contributionType: 'section',
-            courseCode: updatedSection.courseCode
-        });
-        res.status(200).json(updatedSection);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }

[Killed] BooleanLiteral
controllers/sectionController.js:55:13
     const sessionData = req.session.user;
     try {
         const updatedSection = await sectionService.updateSection(id, updateData, sessionData);
-        if (!updatedSection) {
+        if (updatedSection) {
             return res.status(404).json({ error: 'Section not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.7645ms)

[Killed] BlockStatement
controllers/sectionController.js:55:30
     const sessionData = req.session.user;
     try {
         const updatedSection = await sectionService.updateSection(id, updateData, sessionData);
-        if (!updatedSection) {
-            return res.status(404).json({ error: 'Section not found' });
-        }
+        if (!updatedSection) {}
         await userService.addContribution(sessionData.id, {
             refId: updatedSection._id,
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (3.1359ms)
✔ CourseController - createCourse with incomplete data (1.2064ms)

[Killed] ObjectLiteral
controllers/sectionController.js:58:59
         if (!updatedSection) {
             return res.status(404).json({ error: 'Section not found' });
         }
-        await userService.addContribution(sessionData.id, {
-            refId: updatedSection._id,
-            contributionType: 'section',
-            courseCode: updatedSection.courseCode
-        });
+        await userService.addContribution(sessionData.id, {});
         res.status(200).json(updatedSection);
     } catch (error) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.303ms)

[Killed] BlockStatement
controllers/sectionController.js:64:21
             courseCode: updatedSection.courseCode
         });
         res.status(200).json(updatedSection);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2404ms)
