[Killed] BlockStatement
controllers/userController.js:11:43
 exports.searchUsers = async (req, res) => { }
 
 // Gets a user, sends the data to the browser, if the user is not found, sends a 404 error, if there is an error with the database, sends a 500 error.
-exports.getUserById = async (req, res) => {
-    const { id } = req.params;
-    try {
-        const user = await userService.getUserById(id);
-        if (!user) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        res.status(200).json(user);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.getUserById = async (req, res) => {}
 
 // Should begin process of updating a user's data, should only be accessible to the user themselves, or to admins.
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1755ms)

[Killed] BlockStatement
controllers/userController.js:13:9
 // Gets a user, sends the data to the browser, if the user is not found, sends a 404 error, if there is an error with the database, sends a 500 error.
 exports.getUserById = async (req, res) => {
     const { id } = req.params;
-    try {
-        const user = await userService.getUserById(id);
-        if (!user) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        res.status(200).json(user);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.314ms)

[Killed] BlockStatement
controllers/userController.js:15:20
     const { id } = req.params;
     try {
         const user = await userService.getUserById(id);
-        if (!user) {
-            return res.status(404).json({ error: 'User not found' });
-        }
+        if (!user) {}
         res.status(200).json(user);
     } catch (error) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (5.7523ms)

[Killed] BooleanLiteral
controllers/userController.js:15:13
     const { id } = req.params;
     try {
         const user = await userService.getUserById(id);
-        if (!user) {
+        if (user) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.8783ms)

[Killed] StringLiteral
controllers/userController.js:16:50
     try {
         const user = await userService.getUserById(id);
         if (!user) {
-            return res.status(404).json({ error: 'User not found' });
+            return res.status(404).json({ error: "" });
         }
         res.status(200).json(user);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0351ms)

[Killed] BlockStatement
controllers/userController.js:19:21
             return res.status(404).json({ error: 'User not found' });
         }
         res.status(200).json(user);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4349ms)

[Timeout] BlockStatement
controllers/userController.js:26:46
 
 // Should begin process of updating a user's data, should only be accessible to the user themselves, or to admins.
 // Request should be an object with the fields to update, for example: { name: 'New Name', profilePic: 'New Profile Pic' }
-exports.updateUserById = async (req, res) => {
-    const { id } = req.params;
-    const updateData = req.body;
-    try {
-        const updatedUser = await userService.updateUserById(id, updateData);
-        if (!updatedUser) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-
-        // update session to reflect any changed fields
-        if (updateData.profilePic) {
-            req.session.user.profilePic = updateData.profilePic;
-        }
-        if (updateData.username) {
-            req.session.user.username = updateData.username;
-        }
-
-        res.status(200).json(updatedUser);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.updateUserById = async (req, res) => {}
 
 // Exclusively to change user email as it has a two-stage process

[Timeout] BlockStatement
controllers/userController.js:29:9
 exports.updateUserById = async (req, res) => {
     const { id } = req.params;
     const updateData = req.body;
-    try {
-        const updatedUser = await userService.updateUserById(id, updateData);
-        if (!updatedUser) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-
-        // update session to reflect any changed fields
-        if (updateData.profilePic) {
-            req.session.user.profilePic = updateData.profilePic;
-        }
-        if (updateData.username) {
-            req.session.user.username = updateData.username;
-        }
-
-        res.status(200).json(updatedUser);
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }

[Killed] ConditionalExpression
controllers/userController.js:31:13
     const updateData = req.body;
     try {
         const updatedUser = await userService.updateUserById(id, updateData);
-        if (!updatedUser) {
+        if (true) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (26.1469ms)

[Killed] ConditionalExpression
controllers/userController.js:31:13
     const updateData = req.body;
     try {
         const updatedUser = await userService.updateUserById(id, updateData);
-        if (!updatedUser) {
+        if (false) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0912ms)

[Killed] ConditionalExpression
controllers/userController.js:36:13
         }
 
         // update session to reflect any changed fields
-        if (updateData.profilePic) {
+        if (true) {
             req.session.user.profilePic = updateData.profilePic;
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (5.6832ms)

[Killed] ConditionalExpression
controllers/userController.js:36:13
         }
 
         // update session to reflect any changed fields
-        if (updateData.profilePic) {
+        if (false) {
             req.session.user.profilePic = updateData.profilePic;
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.6653ms)

[Killed] BlockStatement
controllers/userController.js:39:34
         if (updateData.profilePic) {
             req.session.user.profilePic = updateData.profilePic;
         }
-        if (updateData.username) {
-            req.session.user.username = updateData.username;
-        }
+        if (updateData.username) {}
 
         res.status(200).json(updatedUser);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4123ms)

[Killed] ConditionalExpression
controllers/userController.js:39:13
         if (updateData.profilePic) {
             req.session.user.profilePic = updateData.profilePic;
         }
-        if (updateData.username) {
+        if (true) {
             req.session.user.username = updateData.username;
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.2795ms)

[Killed] BlockStatement
controllers/userController.js:44:21
         }
 
         res.status(200).json(updatedUser);
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3938ms)

[Killed] BlockStatement
controllers/userController.js:51:47
 
 // Exclusively to change user email as it has a two-stage process
 // Valid request will send a 6-digit code to the new email and set the new email as pending
-exports.changeEmailById = async (req, res) => {
-    const { id } = req.params;
-    const { email } = req.body;
-
-    try {
-        await userService.changeEmailById(id, email);
-
-        res.status(200).json({ message: 'Verification code sent to new email' });
-    } catch (error) {
-        if (error.message.includes('not allowed')) {
-            return res.status(403).json({ error: error.message });
-        }
-        else if (error.message.includes('already exists')) {
-            return res.status(409).json({ error: error.message });
-        }
-        else if (error.message.includes('already associated')) {
-            return res.status(422).json({ error: error.message });
-        }
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.changeEmailById = async (req, res) => {}
 
 // called after verification is sent
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9778ms)

[Killed] BlockStatement
controllers/userController.js:55:9
     const { id } = req.params;
     const { email } = req.body;
 
-    try {
-        await userService.changeEmailById(id, email);
-
-        res.status(200).json({ message: 'Verification code sent to new email' });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('not allowed')) {
             return res.status(403).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.2991ms)

[Killed] BlockStatement
controllers/userController.js:59:21
         await userService.changeEmailById(id, email);
 
         res.status(200).json({ message: 'Verification code sent to new email' });
-    } catch (error) {
-        if (error.message.includes('not allowed')) {
-            return res.status(403).json({ error: error.message });
-        }
-        else if (error.message.includes('already exists')) {
-            return res.status(409).json({ error: error.message });
-        }
-        else if (error.message.includes('already associated')) {
-            return res.status(422).json({ error: error.message });
-        }
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2608ms)

[Killed] ConditionalExpression
controllers/userController.js:60:13
 
         res.status(200).json({ message: 'Verification code sent to new email' });
     } catch (error) {
-        if (error.message.includes('not allowed')) {
+        if (false) {
             return res.status(403).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.356ms)

[Killed] ConditionalExpression
controllers/userController.js:60:13
 
         res.status(200).json({ message: 'Verification code sent to new email' });
     } catch (error) {
-        if (error.message.includes('not allowed')) {
+        if (true) {
             return res.status(403).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1709ms)

[Killed] ObjectLiteral
controllers/userController.js:61:41
         res.status(200).json({ message: 'Verification code sent to new email' });
     } catch (error) {
         if (error.message.includes('not allowed')) {
-            return res.status(403).json({ error: error.message });
+            return res.status(403).json({});
         }
         else if (error.message.includes('already exists')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.7779ms)

[Killed] ConditionalExpression
controllers/userController.js:63:18
         if (error.message.includes('not allowed')) {
             return res.status(403).json({ error: error.message });
         }
-        else if (error.message.includes('already exists')) {
+        else if (false) {
             return res.status(409).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5923ms)

[Killed] BlockStatement
controllers/userController.js:63:60
         if (error.message.includes('not allowed')) {
             return res.status(403).json({ error: error.message });
         }
-        else if (error.message.includes('already exists')) {
-            return res.status(409).json({ error: error.message });
-        }
+        else if (error.message.includes('already exists')) {}
         else if (error.message.includes('already associated')) {
             return res.status(422).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1559ms)

[Killed] ObjectLiteral
controllers/userController.js:64:41
             return res.status(403).json({ error: error.message });
         }
         else if (error.message.includes('already exists')) {
-            return res.status(409).json({ error: error.message });
+            return res.status(409).json({});
         }
         else if (error.message.includes('already associated')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.3739ms)

[Killed] BlockStatement
controllers/userController.js:66:64
         else if (error.message.includes('already exists')) {
             return res.status(409).json({ error: error.message });
         }
-        else if (error.message.includes('already associated')) {
-            return res.status(422).json({ error: error.message });
-        }
+        else if (error.message.includes('already associated')) {}
         res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (3.4822ms)

[Killed] ConditionalExpression
controllers/userController.js:66:18
         else if (error.message.includes('already exists')) {
             return res.status(409).json({ error: error.message });
         }
-        else if (error.message.includes('already associated')) {
+        else if (true) {
             return res.status(422).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (7.4843ms)

[Killed] ObjectLiteral
controllers/userController.js:69:30
         else if (error.message.includes('already associated')) {
             return res.status(422).json({ error: error.message });
         }
-        res.status(500).json({ error: error.message });
+        res.status(500).json({});
     }
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.122ms)

[Killed] BlockStatement
controllers/userController.js:75:50
 
 // called after verification is sent
 // user will send their code and if valid, their email is updated and verified
-exports.confirmEmailChange = async (req, res) => {
-    const { id } = req.params;
-    const { verificationCode } = req.body;
-
-    try {
-        await userService.confirmEmailChange(id, verificationCode);
-
-        res.status(200).json({ message: 'Email change successful' });
-    } catch (error) {
-        if (error.message.includes('Invalid user')) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        else if (error.message.includes('Invalid verification code')) {
-            return res.status(400).json({ error: error.message });
-        }
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.confirmEmailChange = async (req, res) => {}
 
 exports.resetPasswordById = async (req, res) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1888ms)
✔ CourseController - createCourse with incomplete data (1.0242ms)

[Killed] BlockStatement
controllers/userController.js:79:9
     const { id } = req.params;
     const { verificationCode } = req.body;
 
-    try {
-        await userService.confirmEmailChange(id, verificationCode);
-
-        res.status(200).json({ message: 'Email change successful' });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('Invalid user')) {
             return res.status(404).json({ error: 'User not found' });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.4406ms)

[Killed] ObjectLiteral
controllers/userController.js:82:30
     try {
         await userService.confirmEmailChange(id, verificationCode);
 
-        res.status(200).json({ message: 'Email change successful' });
+        res.status(200).json({});
     } catch (error) {
         if (error.message.includes('Invalid user')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.332ms)

[Killed] BlockStatement
controllers/userController.js:83:21
         await userService.confirmEmailChange(id, verificationCode);
 
         res.status(200).json({ message: 'Email change successful' });
-    } catch (error) {
-        if (error.message.includes('Invalid user')) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        else if (error.message.includes('Invalid verification code')) {
-            return res.status(400).json({ error: error.message });
-        }
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0744ms)

[Killed] ConditionalExpression
controllers/userController.js:84:13
 
         res.status(200).json({ message: 'Email change successful' });
     } catch (error) {
-        if (error.message.includes('Invalid user')) {
+        if (true) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2048ms)

[Killed] ConditionalExpression
controllers/userController.js:84:13
 
         res.status(200).json({ message: 'Email change successful' });
     } catch (error) {
-        if (error.message.includes('Invalid user')) {
+        if (false) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9778ms)

[Killed] ConditionalExpression
controllers/userController.js:87:18
         if (error.message.includes('Invalid user')) {
             return res.status(404).json({ error: 'User not found' });
         }
-        else if (error.message.includes('Invalid verification code')) {
+        else if (true) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8777ms)

[Killed] ConditionalExpression
controllers/userController.js:87:18
         if (error.message.includes('Invalid user')) {
             return res.status(404).json({ error: 'User not found' });
         }
-        else if (error.message.includes('Invalid verification code')) {
+        else if (false) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3713ms)

[Killed] ObjectLiteral
controllers/userController.js:88:41
             return res.status(404).json({ error: 'User not found' });
         }
         else if (error.message.includes('Invalid verification code')) {
-            return res.status(400).json({ error: error.message });
+            return res.status(400).json({});
         }
         res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.818ms)

[Killed] BlockStatement
controllers/userController.js:94:49
     }
 }
 
-exports.resetPasswordById = async (req, res) => {
-    try {
-        const { id } = req.params;
-        const userData = req.body;
-
-        await userService.resetPasswordById(id, userData);
-
-        res.status(200).json({ message: 'Password changed successfully' });
-    } catch (error) {
-        if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        } 
-        else if (error.message.includes('Invalid')) {
-            res.status(403).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
-}
+exports.resetPasswordById = async (req, res) => {}
 
 // Should delete a user, should only be accessible to the user themselves, should clear out all saved data related to the user.
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.846ms)

[Killed] BlockStatement
controllers/userController.js:95:9
 }
 
 exports.resetPasswordById = async (req, res) => {
-    try {
-        const { id } = req.params;
-        const userData = req.body;
-
-        await userService.resetPasswordById(id, userData);
-
-        res.status(200).json({ message: 'Password changed successfully' });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9983ms)

[Killed] BlockStatement
controllers/userController.js:102:21
         await userService.resetPasswordById(id, userData);
 
         res.status(200).json({ message: 'Password changed successfully' });
-    } catch (error) {
-        if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        } 
-        else if (error.message.includes('Invalid')) {
-            res.status(403).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.1561ms)

[Killed] ConditionalExpression
controllers/userController.js:103:13
 
         res.status(200).json({ message: 'Password changed successfully' });
     } catch (error) {
-        if (error.message.includes('incomplete')) {
+        if (false) {
             res.status(422).json({ error: error.message });
         } 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0861ms)

[Killed] BlockStatement
controllers/userController.js:103:51
 
         res.status(200).json({ message: 'Password changed successfully' });
     } catch (error) {
-        if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        } 
+        if (error.message.includes('incomplete')) {} 
         else if (error.message.includes('Invalid')) {
             res.status(403).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9378ms)

[Killed] BlockStatement
controllers/userController.js:106:53
         if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
         } 
-        else if (error.message.includes('Invalid')) {
-            res.status(403).json({ error: error.message });
-        }
+        else if (error.message.includes('Invalid')) {}
         else res.status(500).json({ error: error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (11.4505ms)

[Killed] ConditionalExpression
controllers/userController.js:106:18
         if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
         } 
-        else if (error.message.includes('Invalid')) {
+        else if (false) {
             res.status(403).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1104ms)

[Timeout] BlockStatement
controllers/userController.js:114:46
 }
 
 // Should delete a user, should only be accessible to the user themselves, should clear out all saved data related to the user.
-exports.deleteUserById = async (req, res) => {
-    const { id } = req.params;
-    try {
-        const deletedUser = await userService.deleteUserById(id);
-        if (!deletedUser) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        res.status(200).json({ message: 'User deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
-}
+exports.deleteUserById = async (req, res) => {}
 
 // Creates a new user, expects the request body contain: Username, Email and Password.

[Timeout] BlockStatement
controllers/userController.js:116:9
 // Should delete a user, should only be accessible to the user themselves, should clear out all saved data related to the user.
 exports.deleteUserById = async (req, res) => {
     const { id } = req.params;
-    try {
-        const deletedUser = await userService.deleteUserById(id);
-        if (!deletedUser) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        res.status(200).json({ message: 'User deleted successfully' });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: error.message });
     }
