[Killed] BooleanLiteral
controllers/userController.js:118:13
     const { id } = req.params;
     try {
         const deletedUser = await userService.deleteUserById(id);
-        if (!deletedUser) {
+        if (deletedUser) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (5.0148ms)

[Killed] ConditionalExpression
controllers/userController.js:118:13
     const { id } = req.params;
     try {
         const deletedUser = await userService.deleteUserById(id);
-        if (!deletedUser) {
+        if (true) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.149ms)

[Killed] ObjectLiteral
controllers/userController.js:119:41
     try {
         const deletedUser = await userService.deleteUserById(id);
         if (!deletedUser) {
-            return res.status(404).json({ error: 'User not found' });
+            return res.status(404).json({});
         }
         res.status(200).json({ message: 'User deleted successfully' });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.9872ms)

[Killed] StringLiteral
controllers/userController.js:121:41
         if (!deletedUser) {
             return res.status(404).json({ error: 'User not found' });
         }
-        res.status(200).json({ message: 'User deleted successfully' });
+        res.status(200).json({ message: "" });
     } catch (error) {
         res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9757ms)

[Killed] ObjectLiteral
controllers/userController.js:121:30
         if (!deletedUser) {
             return res.status(404).json({ error: 'User not found' });
         }
-        res.status(200).json({ message: 'User deleted successfully' });
+        res.status(200).json({});
     } catch (error) {
         res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8505ms)

[Killed] BlockStatement
controllers/userController.js:122:21
             return res.status(404).json({ error: 'User not found' });
         }
         res.status(200).json({ message: 'User deleted successfully' });
-    } catch (error) {
-        res.status(500).json({ error: error.message });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2602ms)

[Timeout] BlockStatement
controllers/userController.js:129:42
 
 // Creates a new user, expects the request body contain: Username, Email and Password.
 // Currently returns the created user, but may want to return a success message or homepage URL.
-exports.createUser = async (req, res) => {
-    try {
-        const userData = req.body;
-        const newUser = await userService.createUser(userData);
-        res.status(201).json(newUser);
-    }
-    catch (error) {
-        if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        }
-        else if (error.message.includes('not allowed')) {
-            res.status(403).json({ error: error.message });
-        }
-        else if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
-}
+exports.createUser = async (req, res) => {}
 
 // login a user, expects the request body contain: Username, Email and Password.

[Timeout] BlockStatement
controllers/userController.js:130:9
 // Creates a new user, expects the request body contain: Username, Email and Password.
 // Currently returns the created user, but may want to return a success message or homepage URL.
 exports.createUser = async (req, res) => {
-    try {
-        const userData = req.body;
-        const newUser = await userService.createUser(userData);
-        res.status(201).json(newUser);
-    }
+    try {}
     catch (error) {
         if (error.message.includes('already exists')) {

[Killed] BlockStatement
controllers/userController.js:135:19
         const newUser = await userService.createUser(userData);
         res.status(201).json(newUser);
     }
-    catch (error) {
-        if (error.message.includes('already exists')) {
-            res.status(409).json({ error: error.message });
-        }
-        else if (error.message.includes('not allowed')) {
-            res.status(403).json({ error: error.message });
-        }
-        else if (error.message.includes('incomplete')) {
-            res.status(422).json({ error: error.message });
-        }
-        else res.status(500).json({ error: error.message });
-    }
+    catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.1422ms)

[Killed] ConditionalExpression
controllers/userController.js:136:13
         res.status(201).json(newUser);
     }
     catch (error) {
-        if (error.message.includes('already exists')) {
+        if (false) {
             res.status(409).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4046ms)

[Killed] ConditionalExpression
controllers/userController.js:136:13
         res.status(201).json(newUser);
     }
     catch (error) {
-        if (error.message.includes('already exists')) {
+        if (true) {
             res.status(409).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5475ms)

[Killed] BlockStatement
controllers/userController.js:139:57
         if (error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
         }
-        else if (error.message.includes('not allowed')) {
-            res.status(403).json({ error: error.message });
-        }
+        else if (error.message.includes('not allowed')) {}
         else if (error.message.includes('incomplete')) {
             res.status(422).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.488ms)

[Killed] ConditionalExpression
controllers/userController.js:139:18
         if (error.message.includes('already exists')) {
             res.status(409).json({ error: error.message });
         }
-        else if (error.message.includes('not allowed')) {
+        else if (false) {
             res.status(403).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2145ms)

[Timeout] BlockStatement
controllers/userController.js:150:41
 }
 
 // login a user, expects the request body contain: Username, Email and Password.
-exports.loginUser = async (req, res) => {
-    try {
-        const userData = req.body;
-        const user = await userService.loginUser(userData);
-
-        // store session info
-        req.session.user = {
-            id: user._id,
-            email: user.email,
-            username: user.user_name,
-            profilePic: user.profile_pic,
-            role: user.role,
-            is_verified: user.is_verified
-        }
-
-        return res.status(200).json(req.session.user);
-    }
-    catch (error) {
-        if (error.message.includes('Invalid')) {
-            return res.status(403).json({ error: "Invalid email or password" });
-        }
-        return res.status(500).json({ error: error.message });
-    }
-}
+exports.loginUser = async (req, res) => {}
 
 // check if session has a valid user field

[Timeout] BlockStatement
controllers/userController.js:151:9
 
 // login a user, expects the request body contain: Username, Email and Password.
 exports.loginUser = async (req, res) => {
-    try {
-        const userData = req.body;
-        const user = await userService.loginUser(userData);
-
-        // store session info
-        req.session.user = {
-            id: user._id,
-            email: user.email,
-            username: user.user_name,
-            profilePic: user.profile_pic,
-            role: user.role,
-            is_verified: user.is_verified
-        }
-
-        return res.status(200).json(req.session.user);
-    }
+    try {}
     catch (error) {
         if (error.message.includes('Invalid')) {

[Killed] BlockStatement
controllers/userController.js:167:19
 
         return res.status(200).json(req.session.user);
     }
-    catch (error) {
-        if (error.message.includes('Invalid')) {
-            return res.status(403).json({ error: "Invalid email or password" });
-        }
-        return res.status(500).json({ error: error.message });
-    }
+    catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2025ms)

[Killed] ConditionalExpression
controllers/userController.js:168:13
         return res.status(200).json(req.session.user);
     }
     catch (error) {
-        if (error.message.includes('Invalid')) {
+        if (true) {
             return res.status(403).json({ error: "Invalid email or password" });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2234ms)

[Killed] ConditionalExpression
controllers/userController.js:168:13
         return res.status(200).json(req.session.user);
     }
     catch (error) {
-        if (error.message.includes('Invalid')) {
+        if (false) {
             return res.status(403).json({ error: "Invalid email or password" });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (11.3399ms)

[Killed] ObjectLiteral
controllers/userController.js:169:41
     }
     catch (error) {
         if (error.message.includes('Invalid')) {
-            return res.status(403).json({ error: "Invalid email or password" });
+            return res.status(403).json({});
         }
         return res.status(500).json({ error: error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.6714ms)

[Killed] ObjectLiteral
controllers/userController.js:171:37
         if (error.message.includes('Invalid')) {
             return res.status(403).json({ error: "Invalid email or password" });
         }
-        return res.status(500).json({ error: error.message });
+        return res.status(500).json({});
     }
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1151ms)

[Killed] BlockStatement
controllers/userController.js:176:44
 }
 
 // check if session has a valid user field
-exports.checkSession = async (req, res) => {
-    if (!req.session.user) {
-        return res.status(401).json({ error: "Unauthorized" });
-    }
-    res.json(req.session.user);
-}
+exports.checkSession = async (req, res) => {}
 
 // logout through sessions
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0636ms)

[Killed] ConditionalExpression
controllers/userController.js:177:9
 
 // check if session has a valid user field
 exports.checkSession = async (req, res) => {
-    if (!req.session.user) {
+    if (false) {
         return res.status(401).json({ error: "Unauthorized" });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3102ms)

[Killed] ConditionalExpression
controllers/userController.js:177:9
 
 // check if session has a valid user field
 exports.checkSession = async (req, res) => {
-    if (!req.session.user) {
+    if (true) {
         return res.status(401).json({ error: "Unauthorized" });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5846ms)

[Killed] StringLiteral
controllers/userController.js:178:46
 // check if session has a valid user field
 exports.checkSession = async (req, res) => {
     if (!req.session.user) {
-        return res.status(401).json({ error: "Unauthorized" });
+        return res.status(401).json({ error: "" });
     }
     res.json(req.session.user);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.8267ms)

[Killed] ObjectLiteral
controllers/userController.js:178:37
 // check if session has a valid user field
 exports.checkSession = async (req, res) => {
     if (!req.session.user) {
-        return res.status(401).json({ error: "Unauthorized" });
+        return res.status(401).json({});
     }
     res.json(req.session.user);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.1416ms)

[Timeout] BlockStatement
controllers/userController.js:184:36
 }
 
 // logout through sessions
-exports.logoutUser = (req, res) => {
-    // if session doesn't exist, return 400
-    if (!req.session) {
-        return res.status(400).json({ error: "No active session" });
-    }
-
-    // session exists so try and destroy it
-    req.session.destroy((err) => {
-        if (err) {
-            return res.status(500).json({ error: "Failed to logout" });
-        }
-
-        res.clearCookie("connect.sid");
-        return res.status(200).json({ message: "Logged out successfully" });
-    });
-};
+exports.logoutUser = (req, res) => {};
 
 // Send a fresh verification code to the user's current email

[Killed] ConditionalExpression
controllers/userController.js:186:9
 // logout through sessions
 exports.logoutUser = (req, res) => {
     // if session doesn't exist, return 400
-    if (!req.session) {
+    if (false) {
         return res.status(400).json({ error: "No active session" });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2698ms)

[Killed] BooleanLiteral
controllers/userController.js:186:9
 // logout through sessions
 exports.logoutUser = (req, res) => {
     // if session doesn't exist, return 400
-    if (!req.session) {
+    if (req.session) {
         return res.status(400).json({ error: "No active session" });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1356ms)

[Timeout] BlockStatement
controllers/userController.js:191:34
     }
 
     // session exists so try and destroy it
-    req.session.destroy((err) => {
-        if (err) {
-            return res.status(500).json({ error: "Failed to logout" });
-        }
-
-        res.clearCookie("connect.sid");
-        return res.status(200).json({ message: "Logged out successfully" });
-    });
+    req.session.destroy((err) => {});
 };
 

[Killed] ConditionalExpression
controllers/userController.js:192:13
 
     // session exists so try and destroy it
     req.session.destroy((err) => {
-        if (err) {
+        if (true) {
             return res.status(500).json({ error: "Failed to logout" });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1137ms)

[Killed] BlockStatement
controllers/userController.js:192:18
 
     // session exists so try and destroy it
     req.session.destroy((err) => {
-        if (err) {
-            return res.status(500).json({ error: "Failed to logout" });
-        }
+        if (err) {}
 
         res.clearCookie("connect.sid");
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8524ms)

[Killed] StringLiteral
controllers/userController.js:193:50
     // session exists so try and destroy it
     req.session.destroy((err) => {
         if (err) {
-            return res.status(500).json({ error: "Failed to logout" });
+            return res.status(500).json({ error: "" });
         }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.305ms)

[Killed] StringLiteral
controllers/userController.js:196:25
             return res.status(500).json({ error: "Failed to logout" });
         }
 
-        res.clearCookie("connect.sid");
+        res.clearCookie("");
         return res.status(200).json({ message: "Logged out successfully" });
     });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.205ms)

[Killed] StringLiteral
controllers/userController.js:197:48
         }
 
         res.clearCookie("connect.sid");
-        return res.status(200).json({ message: "Logged out successfully" });
+        return res.status(200).json({ message: "" });
     });
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9844ms)

[Killed] ObjectLiteral
controllers/userController.js:197:37
         }
 
         res.clearCookie("connect.sid");
-        return res.status(200).json({ message: "Logged out successfully" });
+        return res.status(200).json({});
     });
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3151ms)

[Killed] BlockStatement
controllers/userController.js:202:55
 };
 
 // Send a fresh verification code to the user's current email
-exports.requestVerificationCode = async (req, res) => {
-    const { id } = req.params;
-    try {
-        await userService.requestVerificationCode(id);
-
-        return res.status(200).json({ message: 'Verification code sent to email' });
-    } catch (error) {
-        if (error.message.includes('not found')) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
-        }
-        else return res.status(500).json({ error: 'Failed to send verification code: ' + error.message });
-    }
-};
+exports.requestVerificationCode = async (req, res) => {};
 
 // Verifies the user's email with the 6-digit code sent during signup
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (4.9726ms)
✔ CourseController - createCourse with incomplete data (1.1313ms)

[Killed] BlockStatement
controllers/userController.js:204:9
 // Send a fresh verification code to the user's current email
 exports.requestVerificationCode = async (req, res) => {
     const { id } = req.params;
-    try {
-        await userService.requestVerificationCode(id);
-
-        return res.status(200).json({ message: 'Verification code sent to email' });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('not found')) {
             return res.status(404).json({ error: 'User not found' });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2517ms)

[Killed] ObjectLiteral
controllers/userController.js:207:37
     try {
         await userService.requestVerificationCode(id);
 
-        return res.status(200).json({ message: 'Verification code sent to email' });
+        return res.status(200).json({});
     } catch (error) {
         if (error.message.includes('not found')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2466ms)

[Killed] BlockStatement
controllers/userController.js:208:21
         await userService.requestVerificationCode(id);
 
         return res.status(200).json({ message: 'Verification code sent to email' });
-    } catch (error) {
-        if (error.message.includes('not found')) {
-            return res.status(404).json({ error: 'User not found' });
-        }
-        else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
-        }
-        else return res.status(500).json({ error: 'Failed to send verification code: ' + error.message });
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1228ms)

[Killed] ConditionalExpression
controllers/userController.js:209:13
 
         return res.status(200).json({ message: 'Verification code sent to email' });
     } catch (error) {
-        if (error.message.includes('not found')) {
+        if (false) {
             return res.status(404).json({ error: 'User not found' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.6552ms)

[Killed] BlockStatement
controllers/userController.js:209:50
 
         return res.status(200).json({ message: 'Verification code sent to email' });
     } catch (error) {
-        if (error.message.includes('not found')) {
-            return res.status(404).json({ error: 'User not found' });
-        }
+        if (error.message.includes('not found')) {}
         else if (error.message.includes('already verified')) {
             return res.status(409).json({ error: 'User is already verified' });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3183ms)

[Killed] ConditionalExpression
controllers/userController.js:212:18
         if (error.message.includes('not found')) {
             return res.status(404).json({ error: 'User not found' });
         }
-        else if (error.message.includes('already verified')) {
+        else if (false) {
             return res.status(409).json({ error: 'User is already verified' });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3551ms)

[Killed] BlockStatement
controllers/userController.js:212:62
         if (error.message.includes('not found')) {
             return res.status(404).json({ error: 'User not found' });
         }
-        else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
-        }
+        else if (error.message.includes('already verified')) {}
         else return res.status(500).json({ error: 'Failed to send verification code: ' + error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.8893ms)

[Killed] StringLiteral
controllers/userController.js:215:51
         else if (error.message.includes('already verified')) {
             return res.status(409).json({ error: 'User is already verified' });
         }
-        else return res.status(500).json({ error: 'Failed to send verification code: ' + error.message });
+        else return res.status(500).json({ error: "" + error.message });
     }
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1958ms)
✔ CourseController - createCourse with incomplete data (0.8766ms)

[Timeout] BlockStatement
controllers/userController.js:221:9
 
 // Verifies the user's email with the 6-digit code sent during signup
 exports.verifyEmail = async (req, res) => {
-    try {
-        const { email, code } = req.body;
-
-        await userService.verifyEmailCode({ email, code });
-
-        // If the user is currently logged in, update their session
-        if (req.session && req.session.user && req.session.user.email === email) {
-            req.session.user.is_verified = true;
-        }
-
-        res.status(200).json({ message: "Email verified successfully" });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes('Invalid')) {
             return res.status(400).json({ error: error.message });

[Killed] ObjectLiteral
controllers/userController.js:224:43
     try {
         const { email, code } = req.body;
 
-        await userService.verifyEmailCode({ email, code });
+        await userService.verifyEmailCode({});
 
         // If the user is currently logged in, update their session
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1254ms)

[Killed] ConditionalExpression
controllers/userController.js:227:48
         await userService.verifyEmailCode({ email, code });
 
         // If the user is currently logged in, update their session
-        if (req.session && req.session.user && req.session.user.email === email) {
+        if (req.session && req.session.user && true) {
             req.session.user.is_verified = true;
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1138ms)

[Killed] LogicalOperator
controllers/userController.js:227:13
         await userService.verifyEmailCode({ email, code });
 
         // If the user is currently logged in, update their session
-        if (req.session && req.session.user && req.session.user.email === email) {
+        if (req.session || req.session.user && req.session.user.email === email) {
             req.session.user.is_verified = true;
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0138ms)
✔ CourseController - createCourse with incomplete data (0.9916ms)

[Killed] BooleanLiteral
controllers/userController.js:228:44
 
         // If the user is currently logged in, update their session
         if (req.session && req.session.user && req.session.user.email === email) {
-            req.session.user.is_verified = true;
+            req.session.user.is_verified = false;
         }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1485ms)
