[Killed] StringLiteral
controllers/userController.js:231:41
             req.session.user.is_verified = true;
         }
 
-        res.status(200).json({ message: "Email verified successfully" });
+        res.status(200).json({ message: "" });
     } catch (error) {
         if (error.message.includes('Invalid')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0759ms)

[Killed] BlockStatement
controllers/userController.js:232:21
         }
 
         res.status(200).json({ message: "Email verified successfully" });
-    } catch (error) {
-        if (error.message.includes('Invalid')) {
-            return res.status(400).json({ error: error.message });
-        }
-        else if (error.message.includes('not found')) {
-            return res.status(404).json({ error: 'User not found' }); 
-        }
-        else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
-        }
-        else if (error.message.includes('incomplete')) {
-            return res.status(422).json({ error: error.message });
-        } 
-        else return res.status(500).json({ error: "Failed to verify email: " + error.message });
-    }
+    } catch (error) {}
 } 
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.2924ms)

[Killed] ConditionalExpression
controllers/userController.js:233:13
 
         res.status(200).json({ message: "Email verified successfully" });
     } catch (error) {
-        if (error.message.includes('Invalid')) {
+        if (true) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1078ms)

[Killed] ConditionalExpression
controllers/userController.js:233:13
 
         res.status(200).json({ message: "Email verified successfully" });
     } catch (error) {
-        if (error.message.includes('Invalid')) {
+        if (false) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0015ms)
✔ CourseController - createCourse with incomplete data (0.8879ms)

[Killed] ConditionalExpression
controllers/userController.js:236:18
         if (error.message.includes('Invalid')) {
             return res.status(400).json({ error: error.message });
         }
-        else if (error.message.includes('not found')) {
+        else if (true) {
             return res.status(404).json({ error: 'User not found' }); 
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.9093ms)
✔ CourseController - createCourse with incomplete data (1.3116ms)

[Killed] BlockStatement
controllers/userController.js:236:55
         if (error.message.includes('Invalid')) {
             return res.status(400).json({ error: error.message });
         }
-        else if (error.message.includes('not found')) {
-            return res.status(404).json({ error: 'User not found' }); 
-        }
+        else if (error.message.includes('not found')) {}
         else if (error.message.includes('already verified')) {
             return res.status(409).json({ error: 'User is already verified' });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0595ms)

[Killed] ObjectLiteral
controllers/userController.js:240:41
             return res.status(404).json({ error: 'User not found' }); 
         }
         else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
+            return res.status(409).json({});
         }
         else if (error.message.includes('incomplete')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1365ms)

[Killed] StringLiteral
controllers/userController.js:240:50
             return res.status(404).json({ error: 'User not found' }); 
         }
         else if (error.message.includes('already verified')) {
-            return res.status(409).json({ error: 'User is already verified' });
+            return res.status(409).json({ error: "" });
         }
         else if (error.message.includes('incomplete')) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3427ms)

[Killed] BlockStatement
controllers/userController.js:242:56
         else if (error.message.includes('already verified')) {
             return res.status(409).json({ error: 'User is already verified' });
         }
-        else if (error.message.includes('incomplete')) {
-            return res.status(422).json({ error: error.message });
-        } 
+        else if (error.message.includes('incomplete')) {} 
         else return res.status(500).json({ error: "Failed to verify email: " + error.message });
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.332ms)
✔ CourseController - createCourse with incomplete data (0.9633ms)

[Killed] ObjectLiteral
controllers/userController.js:243:41
             return res.status(409).json({ error: 'User is already verified' });
         }
         else if (error.message.includes('incomplete')) {
-            return res.status(422).json({ error: error.message });
+            return res.status(422).json({});
         } 
         else return res.status(500).json({ error: "Failed to verify email: " + error.message });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.368ms)

[Timeout] BlockStatement
controllers/userController.js:250:46
 } 
 
 // Start password reset process (generates token and sends email)
-exports.forgotPassword = async (req, res) => {
-    try {
-        const { email } = req.body;
-        if (!email) {
-            return res.status(400).json({ error: "Email is required" });
-        }
-
-        await userService.requestPasswordReset(email);
-
-        // Always return 200, even if email doesn't exist, to prevent enumeration
-        res.status(200).json({ message: "If an account with that email exists, a password reset link has been sent." });
-    } catch (error) {
-        res.status(500).json({ error: "Failed to process password reset request" });
-    }
-}
+exports.forgotPassword = async (req, res) => {}
 
 // Reset password using the token sent via email

[Timeout] BlockStatement
controllers/userController.js:251:9
 
 // Start password reset process (generates token and sends email)
 exports.forgotPassword = async (req, res) => {
-    try {
-        const { email } = req.body;
-        if (!email) {
-            return res.status(400).json({ error: "Email is required" });
-        }
-
-        await userService.requestPasswordReset(email);
-
-        // Always return 200, even if email doesn't exist, to prevent enumeration
-        res.status(200).json({ message: "If an account with that email exists, a password reset link has been sent." });
-    } catch (error) {
+    try {} catch (error) {
         res.status(500).json({ error: "Failed to process password reset request" });
     }

[Killed] BlockStatement
controllers/userController.js:253:21
 exports.forgotPassword = async (req, res) => {
     try {
         const { email } = req.body;
-        if (!email) {
-            return res.status(400).json({ error: "Email is required" });
-        }
+        if (!email) {}
 
         await userService.requestPasswordReset(email);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3481ms)

[Killed] ConditionalExpression
controllers/userController.js:253:13
 exports.forgotPassword = async (req, res) => {
     try {
         const { email } = req.body;
-        if (!email) {
+        if (false) {
             return res.status(400).json({ error: "Email is required" });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.6845ms)

[Killed] ObjectLiteral
controllers/userController.js:254:41
     try {
         const { email } = req.body;
         if (!email) {
-            return res.status(400).json({ error: "Email is required" });
+            return res.status(400).json({});
         }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4838ms)

[Killed] StringLiteral
controllers/userController.js:254:50
     try {
         const { email } = req.body;
         if (!email) {
-            return res.status(400).json({ error: "Email is required" });
+            return res.status(400).json({ error: "" });
         }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2519ms)

[Killed] BlockStatement
controllers/userController.js:261:21
 
         // Always return 200, even if email doesn't exist, to prevent enumeration
         res.status(200).json({ message: "If an account with that email exists, a password reset link has been sent." });
-    } catch (error) {
-        res.status(500).json({ error: "Failed to process password reset request" });
-    }
+    } catch (error) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3596ms)

[Timeout] BlockStatement
controllers/userController.js:267:45
 }
 
 // Reset password using the token sent via email
-exports.resetPassword = async (req, res) => {
-    try {
-        const { token, newPassword } = req.body;
-
-        await userService.resetPasswordWithToken(token, newPassword);
-
-        res.status(200).json({ message: "Password reset successfully" });
-    } catch (error) {
-        if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
-            return res.status(400).json({ error: error.message });
-        }
-        res.status(500).json({ error: "Failed to reset password" });
-    }
-};
+exports.resetPassword = async (req, res) => {};

[Timeout] BlockStatement
controllers/userController.js:268:9
 
 // Reset password using the token sent via email
 exports.resetPassword = async (req, res) => {
-    try {
-        const { token, newPassword } = req.body;
-
-        await userService.resetPasswordWithToken(token, newPassword);
-
-        res.status(200).json({ message: "Password reset successfully" });
-    } catch (error) {
+    try {} catch (error) {
         if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
             return res.status(400).json({ error: error.message });

[Killed] ObjectLiteral
controllers/userController.js:273:30
 
         await userService.resetPasswordWithToken(token, newPassword);
 
-        res.status(200).json({ message: "Password reset successfully" });
+        res.status(200).json({});
     } catch (error) {
         if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2232ms)

[Killed] BlockStatement
controllers/userController.js:274:21
         await userService.resetPasswordWithToken(token, newPassword);
 
         res.status(200).json({ message: "Password reset successfully" });
-    } catch (error) {
-        if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
-            return res.status(400).json({ error: error.message });
-        }
-        res.status(500).json({ error: "Failed to reset password" });
-    }
+    } catch (error) {}
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2117ms)

[Killed] LogicalOperator
controllers/userController.js:275:13
 
         res.status(200).json({ message: "Password reset successfully" });
     } catch (error) {
-        if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
+        if ((error.message.includes("Invalid or expired") || error.message.includes("expired")) && error.message.includes("required")) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0334ms)

[Killed] ConditionalExpression
controllers/userController.js:275:13
 
         res.status(200).json({ message: "Password reset successfully" });
     } catch (error) {
-        if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
+        if (false) {
             return res.status(400).json({ error: error.message });
         }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2812ms)

[Killed] ObjectLiteral
controllers/userController.js:276:41
         res.status(200).json({ message: "Password reset successfully" });
     } catch (error) {
         if (error.message.includes("Invalid or expired") || error.message.includes("expired") || error.message.includes("required")) {
-            return res.status(400).json({ error: error.message });
+            return res.status(400).json({});
         }
         res.status(500).json({ error: "Failed to reset password" });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.263ms)
