[Killed] BlockStatement
services/courseServices.js:3:37
 const courseRepository = require('../repositories/courseRepository');
 
-exports.getAllCourses = async () => {
-    return await courseRepository.getAllCourses();
-}
+exports.getAllCourses = async () => {}
 
 exports.findCourseById = async (id) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.7618ms)

[Killed] BlockStatement
services/courseServices.js:7:40
     return await courseRepository.getAllCourses();
 }
 
-exports.findCourseById = async (id) => {
-    return await courseRepository.getCourseById(id);
-}
+exports.findCourseById = async (id) => {}
 
 //verifies that the course can be created, and that no duplicate courses exist with the same course code, then creates a new course document in the database
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2331ms)

[Killed] ConditionalExpression
services/courseServices.js:16:9
 exports.createCourse = async (courseData) => {
     
-    if (!courseIsComplete) {
+    if (false) {
         throw new Error('Course data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.8389ms)
✔ CourseController - createCourse with incomplete data (1.1458ms)

[Killed] BooleanLiteral
services/courseServices.js:16:9
 exports.createCourse = async (courseData) => {
     
-    if (!courseIsComplete) {
+    if (courseIsComplete) {
         throw new Error('Course data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.2738ms)
✔ CourseController - createCourse with incomplete data (2.0258ms)

[Killed] StringLiteral
services/courseServices.js:17:25
     
     if (!courseIsComplete) {
-        throw new Error('Course data is incomplete');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0316ms)

[Killed] BlockStatement
services/courseServices.js:22:25
 
     const{courseCode} = courseData;
     const existingCourse = await courseRepository.findCourseByCourseCode(courseCode); 
-    if (existingCourse) {
-        throw new Error('Course with this course code already exists');
-    } 
+    if (existingCourse) {} 
     return await courseRepository.createCourse(courseData);
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0379ms)
✔ CourseController - createCourse with incomplete data (1.0015ms)

[Killed] ConditionalExpression
services/courseServices.js:22:9
 
     const{courseCode} = courseData;
     const existingCourse = await courseRepository.findCourseByCourseCode(courseCode); 
-    if (existingCourse) {
+    if (true) {
         throw new Error('Course with this course code already exists');
     } 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5889ms)

[Killed] BlockStatement
services/courseServices.js:27:50
     } 
     return await courseRepository.createCourse(courseData);
 }
-exports.updateCourse = async (id, courseData) => {
-    return await courseRepository.updateCourse(id, courseData);
-}
+exports.updateCourse = async (id, courseData) => {}
 exports.deleteCourse = async (id) => {
     return await courseRepository.deleteCourse(id);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1211ms)
✔ CourseController - createCourse with incomplete data (0.9758ms)

[Killed] BlockStatement
services/courseServices.js:30:38
 exports.updateCourse = async (id, courseData) => {
     return await courseRepository.updateCourse(id, courseData);
 }
-exports.deleteCourse = async (id) => {
-    return await courseRepository.deleteCourse(id);
-}   
+exports.deleteCourse = async (id) => {}   
 exports.getSampleCourses = async () => {
     return await courseRepository.getSampleCourses();
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.2328ms)
✔ CourseController - createCourse with incomplete data (1.5241ms)

[Killed] BlockStatement
services/courseServices.js:33:40
 exports.deleteCourse = async (id) => {
     return await courseRepository.deleteCourse(id);
 }   
-exports.getSampleCourses = async () => {
-    return await courseRepository.getSampleCourses();
-}
+exports.getSampleCourses = async () => {}
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1119ms)
