[Killed] StringLiteral
services/definitionServices.js:6:17
 
 exports.getDefinitionsByCourseCode = async (courseCode) => {
     const definitions = await definitionRepository.getDefinitionsByCourseCode(courseCode);
-    console.log("Fetched definitions from DB:", definitions);
+    console.log("", definitions);
 
     if (!definitions || definitions.length === 0) return [];
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0437ms)

[Killed] LogicalOperator
services/definitionServices.js:8:9
     const definitions = await definitionRepository.getDefinitionsByCourseCode(courseCode);
     console.log("Fetched definitions from DB:", definitions);
 
-    if (!definitions || definitions.length === 0) return [];
+    if (!definitions && definitions.length === 0) return [];
 
     // get all unique userIds from all contributors
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1809ms)

[Killed] BooleanLiteral
services/definitionServices.js:8:9
     const definitions = await definitionRepository.getDefinitionsByCourseCode(courseCode);
     console.log("Fetched definitions from DB:", definitions);
 
-    if (!definitions || definitions.length === 0) return [];
+    if (definitions || definitions.length === 0) return [];
 
     // get all unique userIds from all contributors
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.2203ms)
✔ CourseController - createCourse with incomplete data (0.9407ms)

[Killed] ArrayDeclaration
services/definitionServices.js:11:21
     if (!definitions || definitions.length === 0) return [];
 
     // get all unique userIds from all contributors
-    const userIds = [
-        ...new Set(definitions.flatMap(def => (def.contributors ?? []).map(contributor => contributor.userId))),
-    ];
+    const userIds = [];
     console.log("Unique contributor userIds:", userIds);
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.4937ms)

[Killed] ArrowFunction
services/definitionServices.js:12:76
 
     // get all unique userIds from all contributors
     const userIds = [
-        ...new Set(definitions.flatMap(def => (def.contributors ?? []).map(contributor => contributor.userId))),
+        ...new Set(definitions.flatMap(def => (def.contributors ?? []).map(() => undefined))),
     ];
     console.log("Unique contributor userIds:", userIds);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.7156ms)

[Killed] LogicalOperator
services/definitionServices.js:12:48
 
     // get all unique userIds from all contributors
     const userIds = [
-        ...new Set(definitions.flatMap(def => (def.contributors ?? []).map(contributor => contributor.userId))),
+        ...new Set(definitions.flatMap(def => (def.contributors && []).map(contributor => contributor.userId))),
     ];
     console.log("Unique contributor userIds:", userIds);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3379ms)

[Killed] StringLiteral
services/definitionServices.js:14:17
     const userIds = [
         ...new Set(definitions.flatMap(def => (def.contributors ?? []).map(contributor => contributor.userId))),
     ];
-    console.log("Unique contributor userIds:", userIds);
+    console.log("", userIds);
 
     // fetch all users at once
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2531ms)

[Killed] ArrowFunction
services/definitionServices.js:18:50
 
     // fetch all users at once
     const users = await userService.getUsersByIds(userIds);
-    const userMap = Object.fromEntries(users.map(user => [user._id.toString(), user]));
+    const userMap = Object.fromEntries(users.map(() => undefined));
     console.log("Fetched users:", users);
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2277ms)

[Killed] StringLiteral
services/definitionServices.js:19:17
     // fetch all users at once
     const users = await userService.getUsersByIds(userIds);
     const userMap = Object.fromEntries(users.map(user => [user._id.toString(), user]));
-    console.log("Fetched users:", users);
+    console.log("", users);
 
     // enrich contributors in definitions
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.7115ms)

[Killed] ArrowFunction
services/definitionServices.js:22:49
     console.log("Fetched users:", users);
 
     // enrich contributors in definitions
-    const enrichedDefinitions = definitions.map(def => ({
-        ...def,
-        contributors: (def.contributors ?? []).map(contributor => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
-    }));
+    const enrichedDefinitions = definitions.map(() => undefined);
 
     console.log("Enriched definitions:", enrichedDefinitions);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2348ms)

[Killed] ObjectLiteral
services/definitionServices.js:22:57
     console.log("Fetched users:", users);
 
     // enrich contributors in definitions
-    const enrichedDefinitions = definitions.map(def => ({
-        ...def,
-        contributors: (def.contributors ?? []).map(contributor => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
-    }));
+    const enrichedDefinitions = definitions.map(def => ({}));
 
     console.log("Enriched definitions:", enrichedDefinitions);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3999ms)

[Killed] ArrowFunction
services/definitionServices.js:24:52
     // enrich contributors in definitions
     const enrichedDefinitions = definitions.map(def => ({
         ...def,
-        contributors: (def.contributors ?? []).map(contributor => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
+        contributors: (def.contributors ?? []).map(() => undefined),
     }));
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2138ms)

[Killed] LogicalOperator
services/definitionServices.js:24:24
     // enrich contributors in definitions
     const enrichedDefinitions = definitions.map(def => ({
         ...def,
-        contributors: (def.contributors ?? []).map(contributor => ({
+        contributors: (def.contributors && []).map(contributor => ({
             ...contributor,
             username: userMap[contributor.userId.toString()]?.username,
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2385ms)

[Killed] OptionalChaining
services/definitionServices.js:26:23
         ...def,
         contributors: (def.contributors ?? []).map(contributor => ({
             ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
+            username: userMap[contributor.userId.toString()].username,
             profilePic: userMap[contributor.userId.toString()]?.profile_pic,
         })),
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0588ms)

[Killed] OptionalChaining
services/definitionServices.js:27:25
         contributors: (def.contributors ?? []).map(contributor => ({
             ...contributor,
             username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
+            profilePic: userMap[contributor.userId.toString()].profile_pic,
         })),
     }));
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2306ms)

[Killed] BlockStatement
services/definitionServices.js:35:67
     return enrichedDefinitions;
 };
 
-exports.createDefinition = async (definitionData, sessionData) => {
-    const definitionIsComplete = definitionData.courseCode && definitionData.term && definitionData.definition && definitionData.example;
-    if (!definitionIsComplete) {
-        throw new Error('Definition data is incomplete');
-    }
-
-    // create new definition object to match Definition schema
-    // use sessionData from the cookie to get contributor details
-    const newDefinition = {
-        ...definitionData,
-        contributors: [{
-            userId: sessionData.id,
-            date: new Date(),
-            role: sessionData.role
-        }]
-    };
-
-    return await definitionRepository.createDefinition(newDefinition);
-}
+exports.createDefinition = async (definitionData, sessionData) => {}
 
 exports.deleteDefinition = async (id) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4916ms)

[Killed] LogicalOperator
services/definitionServices.js:36:34
 };
 
 exports.createDefinition = async (definitionData, sessionData) => {
-    const definitionIsComplete = definitionData.courseCode && definitionData.term && definitionData.definition && definitionData.example;
+    const definitionIsComplete = definitionData.courseCode && definitionData.term || definitionData.definition && definitionData.example;
     if (!definitionIsComplete) {
         throw new Error('Definition data is incomplete');
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.906ms)

[Killed] ConditionalExpression
services/definitionServices.js:36:34
 };
 
 exports.createDefinition = async (definitionData, sessionData) => {
-    const definitionIsComplete = definitionData.courseCode && definitionData.term && definitionData.definition && definitionData.example;
+    const definitionIsComplete = false;
     if (!definitionIsComplete) {
         throw new Error('Definition data is incomplete');
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9915ms)

[Killed] ConditionalExpression
services/definitionServices.js:37:9
 
 exports.createDefinition = async (definitionData, sessionData) => {
     const definitionIsComplete = definitionData.courseCode && definitionData.term && definitionData.definition && definitionData.example;
-    if (!definitionIsComplete) {
+    if (false) {
         throw new Error('Definition data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1593ms)
✔ CourseController - createCourse with incomplete data (0.9724ms)

[Killed] BlockStatement
services/definitionServices.js:37:32
 
 exports.createDefinition = async (definitionData, sessionData) => {
     const definitionIsComplete = definitionData.courseCode && definitionData.term && definitionData.definition && definitionData.example;
-    if (!definitionIsComplete) {
-        throw new Error('Definition data is incomplete');
-    }
+    if (!definitionIsComplete) {}
 
     // create new definition object to match Definition schema
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.507ms)

[Killed] ObjectLiteral
services/definitionServices.js:43:27
 
     // create new definition object to match Definition schema
     // use sessionData from the cookie to get contributor details
-    const newDefinition = {
-        ...definitionData,
-        contributors: [{
-            userId: sessionData.id,
-            date: new Date(),
-            role: sessionData.role
-        }]
-    };
+    const newDefinition = {};
 
     return await definitionRepository.createDefinition(newDefinition);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0457ms)

[Killed] BlockStatement
services/definitionServices.js:55:42
     return await definitionRepository.createDefinition(newDefinition);
 }
 
-exports.deleteDefinition = async (id) => {
-    const deletedDefinition = await definitionRepository.deleteDefinition(id);
-    if (!deletedDefinition) {
-        throw new Error('Definition not found');
-    }
-}
+exports.deleteDefinition = async (id) => {}
 
 exports.updateDefinition = async (id, updateData, sessionData) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4676ms)

[Killed] BlockStatement
services/definitionServices.js:57:29
 
 exports.deleteDefinition = async (id) => {
     const deletedDefinition = await definitionRepository.deleteDefinition(id);
-    if (!deletedDefinition) {
-        throw new Error('Definition not found');
-    }
+    if (!deletedDefinition) {}
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.14ms)

[Killed] ConditionalExpression
services/definitionServices.js:57:9
 
 exports.deleteDefinition = async (id) => {
     const deletedDefinition = await definitionRepository.deleteDefinition(id);
-    if (!deletedDefinition) {
+    if (true) {
         throw new Error('Definition not found');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2309ms)

[Killed] BlockStatement
services/definitionServices.js:62:67
     }
 }
 
-exports.updateDefinition = async (id, updateData, sessionData) => {
-
-    const updatedDefinition = await definitionRepository.updateDefinition(id, updateData, sessionData);
-    if (!updatedDefinition) {
-        throw new Error('Definition not found');
-    }
-    return updatedDefinition
-}
+exports.updateDefinition = async (id, updateData, sessionData) => {}
 
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2359ms)

[Killed] ConditionalExpression
services/definitionServices.js:65:9
 exports.updateDefinition = async (id, updateData, sessionData) => {
 
     const updatedDefinition = await definitionRepository.updateDefinition(id, updateData, sessionData);
-    if (!updatedDefinition) {
+    if (false) {
         throw new Error('Definition not found');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.0664ms)

[Killed] BooleanLiteral
services/definitionServices.js:65:9
 exports.updateDefinition = async (id, updateData, sessionData) => {
 
     const updatedDefinition = await definitionRepository.updateDefinition(id, updateData, sessionData);
-    if (!updatedDefinition) {
+    if (updatedDefinition) {
         throw new Error('Definition not found');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.349ms)
