[Killed] ObjectLiteral
services/emailServices.js:6:11
 // Create reusable transporter using Gmail SMTP
 const transporter = nodemailer.createTransport({
     service: 'gmail',
-    auth: {
-        user: process.env.EMAIL_USER,
-        pass: process.env.EMAIL_PASS,
-    },
+    auth: {},
     tls: {
         rejectUnauthorized: false,
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.006ms)

[Killed] ObjectLiteral
services/emailServices.js:10:10
         user: process.env.EMAIL_USER,
         pass: process.env.EMAIL_PASS,
     },
-    tls: {
-        rejectUnauthorized: false,
-    },
+    tls: {},
 });
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1433ms)

[Killed] BooleanLiteral
services/emailServices.js:11:29
         pass: process.env.EMAIL_PASS,
     },
     tls: {
-        rejectUnauthorized: false,
+        rejectUnauthorized: true,
     },
 });
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0547ms)

[Killed] BlockStatement
services/emailServices.js:24:60
  * @param {string} options.html - HTML body
  * @returns {Promise<Object>} - Nodemailer send result
  */
-exports.sendEmail = async ({ to, subject, text, html }) => {
-    const mailOptions = {
-        from: `"CRAM" <${process.env.EMAIL_USER}>`,
-        to,
-        subject,
-        text,
-        html,
-    };
-
-    const info = await transporter.sendMail(mailOptions);
-    return info;
-};
+exports.sendEmail = async ({ to, subject, text, html }) => {};
 
 /**
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9371ms)

[Killed] StringLiteral
services/emailServices.js:26:15
  */
 exports.sendEmail = async ({ to, subject, text, html }) => {
     const mailOptions = {
-        from: `"CRAM" <${process.env.EMAIL_USER}>`,
+        from: ``,
         to,
         subject,
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3518ms)

[Killed] BlockStatement
services/emailServices.js:41:40
  * Verify that the email transporter connection is working
  * @returns {Promise<boolean>}
  */
-exports.verifyConnection = async () => {
-    try {
-        await transporter.verify();
-        console.log('Email service is ready');
-        return true;
-    } catch (error) {
-        console.error('Email service error:', error.message);
-        return false;
-    }
-};
+exports.verifyConnection = async () => {};
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2913ms)

[Killed] BlockStatement
services/emailServices.js:42:9
  * @returns {Promise<boolean>}
  */
 exports.verifyConnection = async () => {
-    try {
-        await transporter.verify();
-        console.log('Email service is ready');
-        return true;
-    } catch (error) {
+    try {} catch (error) {
         console.error('Email service error:', error.message);
         return false;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3248ms)

[Killed] BooleanLiteral
services/emailServices.js:45:16
     try {
         await transporter.verify();
         console.log('Email service is ready');
-        return true;
+        return false;
     } catch (error) {
         console.error('Email service error:', error.message);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2077ms)

[Killed] BlockStatement
services/emailServices.js:46:21
         await transporter.verify();
         console.log('Email service is ready');
         return true;
-    } catch (error) {
-        console.error('Email service error:', error.message);
-        return false;
-    }
+    } catch (error) {}
 };
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3431ms)

[Killed] StringLiteral
services/emailServices.js:47:23
         console.log('Email service is ready');
         return true;
     } catch (error) {
-        console.error('Email service error:', error.message);
+        console.error("", error.message);
         return false;
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1228ms)

[Killed] BooleanLiteral
services/emailServices.js:48:16
         return true;
     } catch (error) {
         console.error('Email service error:', error.message);
-        return false;
+        return true;
     }
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1357ms)
