[Killed] BooleanLiteral
services/sectionServices.js:7:24
 exports.createSection = async (sectionData, sessionData ) => {
     const { courseCode, title, description, body } = sectionData; // extract data
 
-    if (!courseCode || !title || !description || !body) {
+    if (!courseCode || title || !description || !body) {
         throw new Error("Section data is incomplete");
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2406ms)

[Killed] ConditionalExpression
services/sectionServices.js:7:9
 exports.createSection = async (sectionData, sessionData ) => {
     const { courseCode, title, description, body } = sectionData; // extract data
 
-    if (!courseCode || !title || !description || !body) {
+    if (true) {
         throw new Error("Section data is incomplete");
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3216ms)

[Killed] StringLiteral
services/sectionServices.js:8:25
     const { courseCode, title, description, body } = sectionData; // extract data
 
     if (!courseCode || !title || !description || !body) {
-        throw new Error("Section data is incomplete");
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4077ms)

[Killed] ConditionalExpression
services/sectionServices.js:15:9
     const isDuplicateSection = await sectionRepository.isDuplicateSection({courseCode, title});
 
     // titles must be unique within a course
-    if (isDuplicateSection) {
+    if (true) {
         throw new Error("Section with this title already exists");
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0263ms)

[Killed] ConditionalExpression
services/sectionServices.js:15:9
     const isDuplicateSection = await sectionRepository.isDuplicateSection({courseCode, title});
 
     // titles must be unique within a course
-    if (isDuplicateSection) {
+    if (false) {
         throw new Error("Section with this title already exists");
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.2506ms)
✔ CourseController - createCourse with incomplete data (0.9306ms)

[Killed] ObjectLiteral
services/sectionServices.js:21:24
 
     // create new section object to match Section schema
     // use sessionData from the cookie to get contributor details
-    const newSection = {
-        courseCode: courseCode,
-        title,
-        description,
-        body,
-        contributors: [{
-            userId: sessionData.id,
-            date: new Date(),
-            role: sessionData.role,
-        }]
-    };
+    const newSection = {};
 
     return await sectionRepository.createSection(newSection);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9073ms)

[Killed] ObjectLiteral
services/sectionServices.js:26:24
         title,
         description,
         body,
-        contributors: [{
-            userId: sessionData.id,
-            date: new Date(),
-            role: sessionData.role,
-        }]
+        contributors: [{}]
     };
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.8893ms)
✔ CourseController - createCourse with incomplete data (1.0672ms)

[Killed] BlockStatement
services/sectionServices.js:36:57
     return await sectionRepository.createSection(newSection);
 };
 
-exports.getSectionsByCourseCode = async (courseCode) => {
-    const sections = await sectionRepository.getSectionsByCourseCode(courseCode);
-
-    // fetch all unique userIds from sections
-    const userIds = [
-        ...new Set(sections.flatMap((section) => section.contributors.map((contributor) => contributor.userId))),
-    ];
-
-    // fetch all users at once
-    const users = await userService.getUsersByIds(userIds); 
-    const userMap = Object.fromEntries(users.map((user) => [user._id.toString(), user]));
-
-    // add user specific data into section
-    const enrichedSections = sections.map((section) => ({
-        ...section,
-        contributors: section.contributors.map((contributor) => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
-    }));
-    return enrichedSections;
-};
+exports.getSectionsByCourseCode = async (courseCode) => {};
 
 exports.deleteSection = async (id) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0989ms)
✔ CourseController - createCourse with incomplete data (0.9297ms)

[Killed] ArrowFunction
services/sectionServices.js:41:37
 
     // fetch all unique userIds from sections
     const userIds = [
-        ...new Set(sections.flatMap((section) => section.contributors.map((contributor) => contributor.userId))),
+        ...new Set(sections.flatMap(() => undefined)),
     ];
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.8035ms)

[Killed] ArrowFunction
services/sectionServices.js:41:75
 
     // fetch all unique userIds from sections
     const userIds = [
-        ...new Set(sections.flatMap((section) => section.contributors.map((contributor) => contributor.userId))),
+        ...new Set(sections.flatMap((section) => section.contributors.map(() => undefined))),
     ];
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1528ms)

[Killed] ArrowFunction
services/sectionServices.js:46:50
 
     // fetch all users at once
     const users = await userService.getUsersByIds(userIds); 
-    const userMap = Object.fromEntries(users.map((user) => [user._id.toString(), user]));
+    const userMap = Object.fromEntries(users.map(() => undefined));
 
     // add user specific data into section
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2357ms)

[Killed] ArrowFunction
services/sectionServices.js:49:43
     const userMap = Object.fromEntries(users.map((user) => [user._id.toString(), user]));
 
     // add user specific data into section
-    const enrichedSections = sections.map((section) => ({
-        ...section,
-        contributors: section.contributors.map((contributor) => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
-    }));
+    const enrichedSections = sections.map(() => undefined);
     return enrichedSections;
 };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2125ms)

[Killed] ArrowFunction
services/sectionServices.js:51:48
     // add user specific data into section
     const enrichedSections = sections.map((section) => ({
         ...section,
-        contributors: section.contributors.map((contributor) => ({
-            ...contributor,
-            username: userMap[contributor.userId.toString()]?.username,
-            profilePic: userMap[contributor.userId.toString()]?.profile_pic,
-        })),
+        contributors: section.contributors.map(() => undefined),
     }));
     return enrichedSections;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3148ms)

[Killed] BlockStatement
services/sectionServices.js:60:39
     return enrichedSections;
 };
 
-exports.deleteSection = async (id) => {
-    return await sectionRepository.deleteSection(id);
-};
+exports.deleteSection = async (id) => {};
 
 exports.updateSection = async (id, updateData, sessionData) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0531ms)

[Killed] BlockStatement
services/sectionServices.js:64:64
     return await sectionRepository.deleteSection(id);
 };
 
-exports.updateSection = async (id, updateData, sessionData) => {
-    return await sectionRepository.updateSection(id, updateData, sessionData);
-};
+exports.updateSection = async (id, updateData, sessionData) => {};
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2248ms)
