[Killed] BlockStatement
services/userServices.js:8:37
 const crypto = require('crypto');
 
 // get all user details except the password 
-exports.getUserById = async (id) => {
-    const user = await userRepository.findUserById(id);
-    if (user) delete user.password_hash;
-    return user;
-}
+exports.getUserById = async (id) => {}
 
 // get multiple users details by ids
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9355ms)

[Killed] ConditionalExpression
services/userServices.js:10:9
 // get all user details except the password 
 exports.getUserById = async (id) => {
     const user = await userRepository.findUserById(id);
-    if (user) delete user.password_hash;
+    if (true) delete user.password_hash;
     return user;
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0669ms)
✔ CourseController - createCourse with incomplete data (0.9059ms)

[Killed] ConditionalExpression
services/userServices.js:10:9
 // get all user details except the password 
 exports.getUserById = async (id) => {
     const user = await userRepository.findUserById(id);
-    if (user) delete user.password_hash;
+    if (false) delete user.password_hash;
     return user;
 }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3031ms)

[Killed] BlockStatement
services/userServices.js:15:39
 }
 
 // get multiple users details by ids
-exports.getUsersByIds = async (ids) =>{
-    return await User.find({ _id: { $in: ids }}).lean();
-};
+exports.getUsersByIds = async (ids) =>{};
 
 exports.updateUserById = async (id, userData) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2547ms)

[Killed] BlockStatement
services/userServices.js:19:50
     return await User.find({ _id: { $in: ids }}).lean();
 };
 
-exports.updateUserById = async (id, userData) => {
-    const updateData = { ...userData };
-
-    // map profilePic to profile_pic to match schema
-    if (updateData.profilePic) {
-        updateData.profile_pic = updateData.profilePic;
-        delete updateData.profilePic;
-    }
-    if (updateData.username) {
-        updateData.user_name = updateData.username;
-        delete updateData.username;
-    }
-
-    return await userRepository.updateUserById(id, updateData);
-};
+exports.updateUserById = async (id, userData) => {};
 
 exports.changeEmailById = async (id, email) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.13ms)
✔ CourseController - createCourse with incomplete data (1.8088ms)

[Killed] ObjectLiteral
services/userServices.js:20:24
 };
 
 exports.updateUserById = async (id, userData) => {
-    const updateData = { ...userData };
+    const updateData = {};
 
     // map profilePic to profile_pic to match schema
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.3443ms)

[Killed] ConditionalExpression
services/userServices.js:23:9
     const updateData = { ...userData };
 
     // map profilePic to profile_pic to match schema
-    if (updateData.profilePic) {
+    if (true) {
         updateData.profile_pic = updateData.profilePic;
         delete updateData.profilePic;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.2008ms)
✔ CourseController - createCourse with incomplete data (1.1411ms)

[Killed] ConditionalExpression
services/userServices.js:23:9
     const updateData = { ...userData };
 
     // map profilePic to profile_pic to match schema
-    if (updateData.profilePic) {
+    if (false) {
         updateData.profile_pic = updateData.profilePic;
         delete updateData.profilePic;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2164ms)

[Killed] BlockStatement
services/userServices.js:27:30
         updateData.profile_pic = updateData.profilePic;
         delete updateData.profilePic;
     }
-    if (updateData.username) {
-        updateData.user_name = updateData.username;
-        delete updateData.username;
-    }
+    if (updateData.username) {}
 
     return await userRepository.updateUserById(id, updateData);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2194ms)

[Killed] ArrayDeclaration
services/userServices.js:36:28
 };
 
 exports.changeEmailById = async (id, email) => {
-    const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
+    const allowedDomains = [];
 
     // check domain
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2613ms)

[Killed] StringLiteral
services/userServices.js:36:29
 };
 
 exports.changeEmailById = async (id, email) => {
-    const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
+    const allowedDomains = ["", '@myumanitoba.ca'];
 
     // check domain
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.7781ms)

[Killed] ArrowFunction
services/userServices.js:39:41
     const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
 
     // check domain
-    const allowed = allowedDomains.some(domain => email.endsWith(domain));
+    const allowed = allowedDomains.some(() => undefined);
     if (!allowed) throw new Error('Email domain is not allowed');
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2828ms)

[Killed] MethodExpression
services/userServices.js:39:51
     const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
 
     // check domain
-    const allowed = allowedDomains.some(domain => email.endsWith(domain));
+    const allowed = allowedDomains.some(domain => email.startsWith(domain));
     if (!allowed) throw new Error('Email domain is not allowed');
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1117ms)

[Killed] ConditionalExpression
services/userServices.js:40:9
 
     // check domain
     const allowed = allowedDomains.some(domain => email.endsWith(domain));
-    if (!allowed) throw new Error('Email domain is not allowed');
+    if (false) throw new Error('Email domain is not allowed');
 
     // check for changing to email that's already set
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.8053ms)

[Killed] ConditionalExpression
services/userServices.js:40:9
 
     // check domain
     const allowed = allowedDomains.some(domain => email.endsWith(domain));
-    if (!allowed) throw new Error('Email domain is not allowed');
+    if (true) throw new Error('Email domain is not allowed');
 
     // check for changing to email that's already set
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0586ms)

[Killed] ConditionalExpression
services/userServices.js:44:9
 
     // check for changing to email that's already set
     const currentUser = await userRepository.findUserById(id);
-    if (currentUser.email === email) {
+    if (true) {
         throw new Error('Email is already associated with your account');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2911ms)

[Killed] ConditionalExpression
services/userServices.js:44:9
 
     // check for changing to email that's already set
     const currentUser = await userRepository.findUserById(id);
-    if (currentUser.email === email) {
+    if (false) {
         throw new Error('Email is already associated with your account');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9373ms)

[Killed] ConditionalExpression
services/userServices.js:50:9
 
     // check email isn't used by another account
     const doesExist = await userRepository.findUserByEmail(email);
-    if (doesExist && doesExist._id.toString() !== id) {
+    if (false) {
         throw new Error('An account with this email already exists');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1013ms)

[Killed] LogicalOperator
services/userServices.js:50:9
 
     // check email isn't used by another account
     const doesExist = await userRepository.findUserByEmail(email);
-    if (doesExist && doesExist._id.toString() !== id) {
+    if (doesExist || doesExist._id.toString() !== id) {
         throw new Error('An account with this email already exists');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3966ms)

[Killed] ArithmeticOperator
services/userServices.js:55:41
     }
 
     // generate and store verification code against the new email temporarily
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 - Math.random() * 900000).toString();
     await userRepository.setPendingEmail(id, email, verificationCode);
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4361ms)

[Killed] ArithmeticOperator
services/userServices.js:55:50
     }
 
     // generate and store verification code against the new email temporarily
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 + Math.random() / 900000).toString();
     await userRepository.setPendingEmail(id, email, verificationCode);
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.067ms)

[Killed] ObjectLiteral
services/userServices.js:58:35
     const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
     await userRepository.setPendingEmail(id, email, verificationCode);
 
-    await emailServices.sendEmail({
-        to: email,
-        subject: 'CRAM - Verify Your New Email',
-        html: `
-            <div style="font-family: Arial, sans-serif; padding: 20px;">
-                <h2 style="color: #4CAF50;">Verify your new email</h2>
-                <p>Your 6-digit verification code is:</p>
-                <h1 style="letter-spacing: 5px; color: #333; background: #f4f4f4; padding: 10px; display: inline-block; border-radius: 5px;">${verificationCode}</h1>
-                <p>Enter this code in the app to confirm your email change.</p>
-            </div>
-        `
-    });
+    await emailServices.sendEmail({});
 
     return { message: 'Verification code sent to new email' };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2395ms)

[Killed] StringLiteral
services/userServices.js:60:18
 
     await emailServices.sendEmail({
         to: email,
-        subject: 'CRAM - Verify Your New Email',
+        subject: "",
         html: `
             <div style="font-family: Arial, sans-serif; padding: 20px;">
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.6803ms)

[Killed] StringLiteral
services/userServices.js:61:15
     await emailServices.sendEmail({
         to: email,
         subject: 'CRAM - Verify Your New Email',
-        html: `
-            <div style="font-family: Arial, sans-serif; padding: 20px;">
-                <h2 style="color: #4CAF50;">Verify your new email</h2>
-                <p>Your 6-digit verification code is:</p>
-                <h1 style="letter-spacing: 5px; color: #333; background: #f4f4f4; padding: 10px; display: inline-block; border-radius: 5px;">${verificationCode}</h1>
-                <p>Enter this code in the app to confirm your email change.</p>
-            </div>
-        `
+        html: ``
     });
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.323ms)

[Killed] ObjectLiteral
services/userServices.js:71:12
         `
     });
 
-    return { message: 'Verification code sent to new email' };
+    return {};
 }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2973ms)

[Killed] BlockStatement
services/userServices.js:74:62
     return { message: 'Verification code sent to new email' };
 }
 
-exports.confirmEmailChange = async (id, verificationCode) => {
-    const user = await this.getUserById(id);
-    console.log(verificationCode);
-
-    if (!user) throw new Error('Invalid user');
-
-    if (user.verification_code !== verificationCode) {
-        throw new Error('Invalid verification code');
-    }
-
-    return userRepository.confirmEmailChange(id);
-}
+exports.confirmEmailChange = async (id, verificationCode) => {}
 
 exports.deleteUserById = async (id) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1402ms)

[Killed] ConditionalExpression
services/userServices.js:78:9
     const user = await this.getUserById(id);
     console.log(verificationCode);
 
-    if (!user) throw new Error('Invalid user');
+    if (false) throw new Error('Invalid user');
 
     if (user.verification_code !== verificationCode) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2161ms)

[Killed] BooleanLiteral
services/userServices.js:78:9
     const user = await this.getUserById(id);
     console.log(verificationCode);
 
-    if (!user) throw new Error('Invalid user');
+    if (user) throw new Error('Invalid user');
 
     if (user.verification_code !== verificationCode) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2232ms)

[Killed] ConditionalExpression
services/userServices.js:80:9
 
     if (!user) throw new Error('Invalid user');
 
-    if (user.verification_code !== verificationCode) {
+    if (true) {
         throw new Error('Invalid verification code');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3564ms)

[Killed] EqualityOperator
services/userServices.js:80:9
 
     if (!user) throw new Error('Invalid user');
 
-    if (user.verification_code !== verificationCode) {
+    if (user.verification_code === verificationCode) {
         throw new Error('Invalid verification code');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9004ms)

[Killed] BlockStatement
services/userServices.js:87:40
     return userRepository.confirmEmailChange(id);
 }
 
-exports.deleteUserById = async (id) => {
-    return await userRepository.deleteUserById(id);
-}
+exports.deleteUserById = async (id) => {}
 
 //verifies that the user can create an account, and that no duplicate accounts exist with the same email, then creates a new user document in the database
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1777ms)

[Killed] LogicalOperator
services/userServices.js:96:9
     const { name, email, password } = userData; // extract data
 
     // incomplete if any field is missing
-    if (!name || !email || !password) {
+    if ((!name || !email) && !password) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (6.5825ms)

[Killed] ConditionalExpression
services/userServices.js:96:9
     const { name, email, password } = userData; // extract data
 
     // incomplete if any field is missing
-    if (!name || !email || !password) {
+    if (false) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0187ms)

[Killed] StringLiteral
services/userServices.js:97:25
 
     // incomplete if any field is missing
     if (!name || !email || !password) {
-        throw new Error('User data is incomplete');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.248ms)

[Killed] StringLiteral
services/userServices.js:101:46
     }
 
     // check domain
-    const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
+    const allowedDomains = ['@umanitoba.ca', ""];
 
     const allowed = allowedDomains.some(domain => email.endsWith(domain));
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.76ms)

[Timeout] ArrowFunction
services/userServices.js:103:41
     // check domain
     const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
 
-    const allowed = allowedDomains.some(domain => email.endsWith(domain));
+    const allowed = allowedDomains.some(() => undefined);
     if (!allowed) throw new Error('Email domain is not allowed');
 

[Timeout] MethodExpression
services/userServices.js:103:21
     // check domain
     const allowedDomains = ['@umanitoba.ca', '@myumanitoba.ca'];
 
-    const allowed = allowedDomains.some(domain => email.endsWith(domain));
+    const allowed = allowedDomains.every(domain => email.endsWith(domain));
     if (!allowed) throw new Error('Email domain is not allowed');
 

[Killed] ConditionalExpression
services/userServices.js:108:9
 
     // check if user already exists
     const doesExist = await userRepository.findUserByEmail(email);
-    if (doesExist) throw new Error('An account with this email already exists');
+    if (false) throw new Error('An account with this email already exists');
 
     // hash password
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2423ms)

[Timeout] ConditionalExpression
services/userServices.js:108:9
 
     // check if user already exists
     const doesExist = await userRepository.findUserByEmail(email);
-    if (doesExist) throw new Error('An account with this email already exists');
+    if (true) throw new Error('An account with this email already exists');
 
     // hash password

[Killed] ConditionalExpression
services/userServices.js:115:9
 
     // assign role
     let role;
-    if (email.endsWith('@myumanitoba.ca')) {
+    if (true) {
         role = 'student';
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.3068ms)
✔ CourseController - createCourse with incomplete data (0.8787ms)

[Timeout] ConditionalExpression
services/userServices.js:115:9
 
     // assign role
     let role;
-    if (email.endsWith('@myumanitoba.ca')) {
+    if (false) {
         role = 'student';
     }

[Killed] MethodExpression
services/userServices.js:118:14
     if (email.endsWith('@myumanitoba.ca')) {
         role = 'student';
     }
-    else if (email.endsWith('@umanitoba.ca')) {
+    else if (email.startsWith('@umanitoba.ca')) {
         role = 'professor';
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4604ms)

[Killed] BlockStatement
services/userServices.js:118:47
     if (email.endsWith('@myumanitoba.ca')) {
         role = 'student';
     }
-    else if (email.endsWith('@umanitoba.ca')) {
-        role = 'professor';
-    }
+    else if (email.endsWith('@umanitoba.ca')) {}
 
     // Generate 6-digit code
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3003ms)

[Killed] StringLiteral
services/userServices.js:119:16
         role = 'student';
     }
     else if (email.endsWith('@umanitoba.ca')) {
-        role = 'professor';
+        role = "";
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.1554ms)
✔ CourseController - createCourse with incomplete data (1.0453ms)

[Killed] ArithmeticOperator
services/userServices.js:123:41
     }
 
     // Generate 6-digit code
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 - Math.random() * 900000).toString();
 
     // create new user object
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.7212ms)

[Killed] ArithmeticOperator
services/userServices.js:123:50
     }
 
     // Generate 6-digit code
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 + Math.random() / 900000).toString();
 
     // create new user object
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.9326ms)

[Timeout] ObjectLiteral
services/userServices.js:126:21
     const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
 
     // create new user object
-    const newUser = {
-        user_name: name,
-        email,
-        password_hash: passwordHash,
-        role,
-        is_verified: false,
-        verification_code: verificationCode
-    };
+    const newUser = {};
 
     const createdUser = await userRepository.createUser(newUser);

[Killed] BooleanLiteral
services/userServices.js:131:22
         email,
         password_hash: passwordHash,
         role,
-        is_verified: false,
+        is_verified: true,
         verification_code: verificationCode
     };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1705ms)

[Killed] ObjectLiteral
services/userServices.js:138:35
     const createdUser = await userRepository.createUser(newUser);
 
     // Send the verification email
-    await emailServices.sendEmail({
-        to: email,
-        subject: 'CRAM - Verify Your Email',
-        html: `
-            <div style="font-family: Arial, sans-serif; padding: 20px;">
-                <h2 style="color: #4CAF50;">Welcome to CRAM!</h2>
-                <p>Your 6-digit verification code is:</p>
-                <h1 style="letter-spacing: 5px; color: #333; background: #f4f4f4; padding: 10px; display: inline-block; border-radius: 5px;">${verificationCode}</h1>
-                <p>Enter this code in the app to verify your account.</p>
-            </div>
-        `
-    });
+    await emailServices.sendEmail({});
 
     return createdUser;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3916ms)

[Killed] StringLiteral
services/userServices.js:140:18
     // Send the verification email
     await emailServices.sendEmail({
         to: email,
-        subject: 'CRAM - Verify Your Email',
+        subject: "",
         html: `
             <div style="font-family: Arial, sans-serif; padding: 20px;">
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.794ms)

[Timeout] BlockStatement
services/userServices.js:155:41
 }
 
 //verifies that the user exists, and that the password matches the stored hash
-exports.loginUser = async (userData) => {
-    const { email, password } = userData; // extract data
-    const normalizedEmail = email.toLowerCase();
-
-    // check if user exists
-    const user = await userRepository.findUserByEmail(normalizedEmail);
-
-    if (!user) {
-        throw new Error("Invalid email");
-    }
-
-    // checks if passwords match
-    const isValid = await passwordServices.verifyPassword(password, user.password_hash);
-
-    if (!isValid) {
-        throw new Error("Invalid password");
-    }
-
-    return user;
-}
+exports.loginUser = async (userData) => {}
 
 // request a verification code if wanting to verify through profile page

[Timeout] MethodExpression
services/userServices.js:157:29
 //verifies that the user exists, and that the password matches the stored hash
 exports.loginUser = async (userData) => {
     const { email, password } = userData; // extract data
-    const normalizedEmail = email.toLowerCase();
+    const normalizedEmail = email.toUpperCase();
 
     // check if user exists

[Killed] BlockStatement
services/userServices.js:162:16
     // check if user exists
     const user = await userRepository.findUserByEmail(normalizedEmail);
 
-    if (!user) {
-        throw new Error("Invalid email");
-    }
+    if (!user) {}
 
     // checks if passwords match
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (4.5568ms)

[Killed] StringLiteral
services/userServices.js:163:25
     const user = await userRepository.findUserByEmail(normalizedEmail);
 
     if (!user) {
-        throw new Error("Invalid email");
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1281ms)

[Killed] ConditionalExpression
services/userServices.js:169:9
     // checks if passwords match
     const isValid = await passwordServices.verifyPassword(password, user.password_hash);
 
-    if (!isValid) {
+    if (false) {
         throw new Error("Invalid password");
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.255ms)

[Killed] BlockStatement
services/userServices.js:169:19
     // checks if passwords match
     const isValid = await passwordServices.verifyPassword(password, user.password_hash);
 
-    if (!isValid) {
-        throw new Error("Invalid password");
-    }
+    if (!isValid) {}
 
     return user;
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9706ms)
