[Killed] BlockStatement
services/userServices.js:180:16
 exports.requestVerificationCode = async (id) => {
     const user = await userRepository.findUserById(id);
 
-    if (!user) {
-        throw new Error('User not found');
-    }
+    if (!user) {}
 
     if (user.is_verified) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (5.4018ms)

[Killed] ConditionalExpression
services/userServices.js:184:9
         throw new Error('User not found');
     }
 
-    if (user.is_verified) {
+    if (false) {
         throw new Error('User is already verified');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (2.0979ms)
✔ CourseController - createCourse with incomplete data (1.1257ms)

[Killed] ConditionalExpression
services/userServices.js:184:9
         throw new Error('User not found');
     }
 
-    if (user.is_verified) {
+    if (true) {
         throw new Error('User is already verified');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.8767ms)
✔ CourseController - createCourse with incomplete data (0.8215ms)

[Killed] ArithmeticOperator
services/userServices.js:188:50
         throw new Error('User is already verified');
     }
 
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 + Math.random() / 900000).toString();
 
     await userRepository.updateUserById(id, {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (1.9337ms)

[Killed] ArithmeticOperator
services/userServices.js:188:41
         throw new Error('User is already verified');
     }
 
-    const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
+    const verificationCode = Math.floor(100000 - Math.random() * 900000).toString();
 
     await userRepository.updateUserById(id, {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1192ms)

[Killed] ObjectLiteral
services/userServices.js:190:45
 
     const verificationCode = Math.floor(100000 + Math.random() * 900000).toString();
 
-    await userRepository.updateUserById(id, {
-        verification_code: verificationCode
-    });
+    await userRepository.updateUserById(id, {});
 
     await emailServices.sendEmail({
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1161ms)

[Killed] ObjectLiteral
services/userServices.js:194:35
         verification_code: verificationCode
     });
 
-    await emailServices.sendEmail({
-        to: user.email,
-        subject: 'CRAM - Verify Your Email',
-        html: `
-            <div style="font-family: Arial, sans-serif; padding: 20px;">
-                <h2 style="color: #4CAF50;">Verify your account</h2>
-                <p>Your 6-digit verification code is:</p>
-                <h1 style="letter-spacing: 5px; color: #333; background: #f4f4f4; padding: 10px; display: inline-block; border-radius: 5px;">${verificationCode}</h1>
-                <p>Enter this code in the app to verify your account.</p>
-            </div>
-        `
-    });
+    await emailServices.sendEmail({});
 
     return { message: 'Verification code sent' };
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2604ms)

[Killed] StringLiteral
services/userServices.js:196:18
 
     await emailServices.sendEmail({
         to: user.email,
-        subject: 'CRAM - Verify Your Email',
+        subject: "",
         html: `
             <div style="font-family: Arial, sans-serif; padding: 20px;">
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.9467ms)

[Killed] StringLiteral
services/userServices.js:207:23
         `
     });
 
-    return { message: 'Verification code sent' };
+    return { message: "" };
 };
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.6295ms)

[Killed] ObjectLiteral
services/userServices.js:207:12
         `
     });
 
-    return { message: 'Verification code sent' };
+    return {};
 };
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2009ms)

[Killed] BlockStatement
services/userServices.js:211:54
 };
 
 // Verifies a user's email using the 6-digit code
-exports.verifyEmailCode = async ({ email, code }) => {
-    if (!email || !code) {
-        throw new Error('User data is incomplete');
-    }
-
-    const normalizedEmail = email.toLowerCase();
-    const user = await userRepository.findUserByEmail(normalizedEmail);
-
-    if (!user) {
-        throw new Error('User not found');
-    }
-
-    if (user.is_verified) {
-        throw new Error('User is already verified');
-    }
-
-    if (user.verification_code !== code) {
-        throw new Error('Invalid verification code');
-    }
-
-    // Verify user (sets is_verified: true, removes code)
-    await userRepository.verifyUser(normalizedEmail);
-
-    return true;
-}
+exports.verifyEmailCode = async ({ email, code }) => {}
 
 // Generates a reset token, saves it to the user in the database, and sends a password reset email
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1561ms)

[Killed] ConditionalExpression
services/userServices.js:212:9
 
 // Verifies a user's email using the 6-digit code
 exports.verifyEmailCode = async ({ email, code }) => {
-    if (!email || !code) {
+    if (false) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0614ms)

[Killed] BooleanLiteral
services/userServices.js:212:9
 
 // Verifies a user's email using the 6-digit code
 exports.verifyEmailCode = async ({ email, code }) => {
-    if (!email || !code) {
+    if (email || !code) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.9192ms)
✔ CourseController - createCourse with incomplete data (0.9629ms)

[Killed] StringLiteral
services/userServices.js:213:25
 // Verifies a user's email using the 6-digit code
 exports.verifyEmailCode = async ({ email, code }) => {
     if (!email || !code) {
-        throw new Error('User data is incomplete');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1915ms)

[Killed] MethodExpression
services/userServices.js:216:29
         throw new Error('User data is incomplete');
     }
 
-    const normalizedEmail = email.toLowerCase();
+    const normalizedEmail = email.toUpperCase();
     const user = await userRepository.findUserByEmail(normalizedEmail);
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1248ms)

[Killed] ConditionalExpression
services/userServices.js:227:9
         throw new Error('User is already verified');
     }
 
-    if (user.verification_code !== code) {
+    if (true) {
         throw new Error('Invalid verification code');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2976ms)

[Killed] EqualityOperator
services/userServices.js:227:9
         throw new Error('User is already verified');
     }
 
-    if (user.verification_code !== code) {
+    if (user.verification_code === code) {
         throw new Error('Invalid verification code');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1415ms)

[Killed] StringLiteral
services/userServices.js:228:25
     }
 
     if (user.verification_code !== code) {
-        throw new Error('Invalid verification code');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.3422ms)

[Timeout] MethodExpression
services/userServices.js:239:29
 
 // Generates a reset token, saves it to the user in the database, and sends a password reset email
 exports.requestPasswordReset = async (email) => {
-    const normalizedEmail = email.toLowerCase();
+    const normalizedEmail = email.toUpperCase();
     const user = await userRepository.findUserByEmail(normalizedEmail);
 

[Killed] ConditionalExpression
services/userServices.js:243:9
     const user = await userRepository.findUserByEmail(normalizedEmail);
 
     // We don't throw an error if the user doesn't exist to prevent email enumeration
-    if (!user) return;
+    if (false) return;
 
     // Generate a secure random token
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}
✔ CourseController - createCourse (1.9422ms)
✔ CourseController - createCourse with incomplete data (1.2189ms)

[Timeout] ConditionalExpression
services/userServices.js:243:9
     const user = await userRepository.findUserByEmail(normalizedEmail);
 
     // We don't throw an error if the user doesn't exist to prevent email enumeration
-    if (!user) return;
+    if (true) return;
 
     // Generate a secure random token

[Timeout] ArithmeticOperator
services/userServices.js:249:29
     const token = crypto.randomBytes(32).toString('hex');
 
     // Expiry time set to 1 hour from now
-    const expiry = new Date(Date.now() + 3600000);
+    const expiry = new Date(Date.now() - 3600000);
 
     await userRepository.setResetToken(normalizedEmail, token, expiry);

[Killed] StringLiteral
services/userServices.js:257:18
     const resetUrl = `http://localhost:5173/reset-password?token=${token}`;
     await emailServices.sendEmail({
         to: normalizedEmail,
-        subject: 'CRAM Password Reset',
+        subject: "",
         html: `
             <div style="font-family: Arial, sans-serif; padding: 20px;">
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.2983ms)

[Killed] BlockStatement
services/userServices.js:272:33
 
 // Validates a reset token and updates the user's password if valid and not expired
 exports.resetPasswordWithToken = async (token, newPassword) => {
-    if (!token || !newPassword) {
-        throw new Error('Token and new password are required');
-    }
+    if (!token || !newPassword) {}
 
     const user = await userRepository.findUserByResetToken(token);
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.4384ms)

[Killed] ConditionalExpression
services/userServices.js:272:9
 
 // Validates a reset token and updates the user's password if valid and not expired
 exports.resetPasswordWithToken = async (token, newPassword) => {
-    if (!token || !newPassword) {
+    if (false) {
         throw new Error('Token and new password are required');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0509ms)

[Killed] BlockStatement
services/userServices.js:278:16
 
     const user = await userRepository.findUserByResetToken(token);
 
-    if (!user) {
-        throw new Error('Invalid or expired password reset token');
-    }
+    if (!user) {}
 
     if (user.reset_token_expiry < new Date()) {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.5258ms)

[Killed] StringLiteral
services/userServices.js:279:25
     const user = await userRepository.findUserByResetToken(token);
 
     if (!user) {
-        throw new Error('Invalid or expired password reset token');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.298ms)

[Killed] EqualityOperator
services/userServices.js:282:9
         throw new Error('Invalid or expired password reset token');
     }
 
-    if (user.reset_token_expiry < new Date()) {
+    if (user.reset_token_expiry <= new Date()) {
         throw new Error('Password reset token has expired');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (3.3406ms)

[Killed] BlockStatement
services/userServices.js:282:47
         throw new Error('Invalid or expired password reset token');
     }
 
-    if (user.reset_token_expiry < new Date()) {
-        throw new Error('Password reset token has expired');
-    }
+    if (user.reset_token_expiry < new Date()) {}
 
     // Hash new password
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2943ms)

[Killed] BlockStatement
services/userServices.js:298:47
     return true;
 }
 
-exports.addContribution = async (id, data) => {
-    return await userRepository.addContribution(id, data);
-}
+exports.addContribution = async (id, data) => {}
 
 exports.resetPasswordById = async (id, userData) => {
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.1806ms)

[Killed] BlockStatement
services/userServices.js:302:53
     return await userRepository.addContribution(id, data);
 }
 
-exports.resetPasswordById = async (id, userData) => {
-    const { currentPassword, newPassword, confirmPassword } = userData;
-    
-    if (!currentPassword || !newPassword || !confirmPassword) {
-        throw new Error('User data is incomplete');
-    }
-
-    // check if the current password was valid
-    const passwordHash = await passwordServices.getPasswordById(id);
-    const isValid = await passwordServices.verifyPassword(currentPassword, passwordHash);
-
-    if (!isValid) { 
-        throw new Error('Invalid current password');
-    }
-
-    // hash the new password and update the user
-    const newHash = await passwordServices.hashPassword(newPassword);
-
-    return await userRepository.updateUserById(id, { password_hash: newHash });
-}
+exports.resetPasswordById = async (id, userData) => {}
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0841ms)

[Killed] BooleanLiteral
services/userServices.js:305:29
 exports.resetPasswordById = async (id, userData) => {
     const { currentPassword, newPassword, confirmPassword } = userData;
     
-    if (!currentPassword || !newPassword || !confirmPassword) {
+    if (!currentPassword || newPassword || !confirmPassword) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.322ms)

[Killed] BooleanLiteral
services/userServices.js:305:9
 exports.resetPasswordById = async (id, userData) => {
     const { currentPassword, newPassword, confirmPassword } = userData;
     
-    if (!currentPassword || !newPassword || !confirmPassword) {
+    if (currentPassword || !newPassword || !confirmPassword) {
         throw new Error('User data is incomplete');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2286ms)

[Killed] StringLiteral
services/userServices.js:306:25
     const { currentPassword, newPassword, confirmPassword } = userData;
     
     if (!currentPassword || !newPassword || !confirmPassword) {
-        throw new Error('User data is incomplete');
+        throw new Error("");
     }
 
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.0906ms)

[Killed] ConditionalExpression
services/userServices.js:313:9
     const passwordHash = await passwordServices.getPasswordById(id);
     const isValid = await passwordServices.verifyPassword(currentPassword, passwordHash);
 
-    if (!isValid) { 
+    if (true) { 
         throw new Error('Invalid current password');
     }
killedBy: All tests
statusReason: {
  statusCode: 500,
  body: { error: 'Database Error' },
  status: [Function: status],
  json: [Function: json]
}

✔ CourseController - createCourse (2.2796ms)
