[Killed] MethodExpression
src/utils/homeHelpers.ts:26:18
 
 // Lab boolean is not in database.
 export function inferHasLab(attrs: string[], raw: string) {// Stryker disable next-line StringLiteral
-    const text = `${attrs.join(" ")} ${raw ?? ""}`.toLowerCase();
+    const text = `${attrs.join(" ")} ${raw ?? ""}`.toUpperCase();
     return /\blab\b|\blaboratory\b/.test(text);
 }
killedBy: inferHasLab returns true when attrs contains 'Lab'
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/utils/homeHelpers.ts:26:40
 
 // Lab boolean is not in database.
 export function inferHasLab(attrs: string[], raw: string) {// Stryker disable next-line StringLiteral
-    const text = `${attrs.join(" ")} ${raw ?? ""}`.toLowerCase();
+    const text = `${attrs.join(" ")} ${raw && ""}`.toLowerCase();
     return /\blab\b|\blaboratory\b/.test(text);
 }
killedBy: inferHasLab returns true when raw string contains 'lab'
statusReason: expected false to be true // Object.is equality
