[Killed] LogicalOperator
src/api/sectionsApi.ts:55:32
 }
 
  export function getBackendMessage(body: unknown): string | undefined {
-    return isErrorBody(body) ? body.error ?? body.message : undefined;
+    return isErrorBody(body) ? body.error && body.message : undefined;
 }
 
killedBy: createSection throws 409 error message from backend
statusReason: expected [Function] to throw error including 'Section already exists' but got 'Invalid request.'
